using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace RecruitingPlatform.Migrations
{
    /// <inheritdoc />
    public partial class DataSeedingAdded : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropTable(
                name: "resumes_documents");

            migrationBuilder.InsertData(
                table: "application_statuses",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Rejected" },
                    { 2, "Applied" },
                    { 3, "Approved" }
                });

            migrationBuilder.InsertData(
                table: "currencies",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "UAH" },
                    { 2, "USD" },
                    { 3, "EUR" }
                });

            migrationBuilder.InsertData(
                table: "industries",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "IT, комп'ютери, інтернет" },
                    { 2, "Маркетинг, реклама, PR" },
                    { 3, "Продажі, закупівлі" },
                    { 4, "Бухгалтерія, аудит, фінанси" },
                    { 5, "Логістика, склад, ЗЕД" },
                    { 6, "Сільське господарство, агробізнес" },
                    { 7, "Виробництво, інженерія, технології" },
                    { 8, "Медицина, фармацевтика" },
                    { 9, "Готельно-ресторанний бізнес, туризм (HoReCa)" },
                    { 10, "Культура, мистецтво, медіа, дизайн" },
                    { 11, "Будівництво, архітектура" },
                    { 12, "Освіта, наука, переклад" },
                    { 13, "Юриспруденція" },
                    { 14, "HR, управління персоналом" },
                    { 15, "Роздрібна торгівля (Retail)" }
                });

            migrationBuilder.InsertData(
                table: "regions",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Автономна Республіка Крим" },
                    { 2, "Вінницька область" },
                    { 3, "Волинська область" },
                    { 4, "Дніпропетровська область" },
                    { 5, "Донецька область" },
                    { 6, "Житомирська область" },
                    { 7, "Закарпатська область" },
                    { 8, "Запорізька область" },
                    { 9, "Івано-Франківська область" },
                    { 10, "Київська область" },
                    { 11, "Кіровоградська область" },
                    { 12, "Луганська область" },
                    { 13, "Львівська область" },
                    { 14, "Миколаївська область" },
                    { 15, "Одеська область" },
                    { 16, "Полтавська область" },
                    { 17, "Рівненська область" },
                    { 18, "Сумська область" },
                    { 19, "Тернопільська область" },
                    { 20, "Харківська область" },
                    { 21, "Херсонська область" },
                    { 22, "Хмельницька область" },
                    { 23, "Черкаська область" },
                    { 24, "Чернівецька область" },
                    { 25, "Чернігівська область" },
                    { 26, "Київ" },
                    { 27, "Севастополь" }
                });

            migrationBuilder.InsertData(
                table: "skill_types",
                columns: new[] { "Id", "Name" },
                values: new object[,]
                {
                    { 1, "Софт скіли" },
                    { 2, "Програмування, бази даних та IT" },
                    { 3, "Математика та аналіз даних" },
                    { 4, "Водіння та логістика" },
                    { 5, "Знання мов" },
                    { 6, "Знання програм та інструментів" },
                    { 7, "Верстати, інженерія та виробництво" },
                    { 8, "Бізнес, продажі, маркетинг, HR" },
                    { 9, "Творчість, література та мистецтво" },
                    { 10, "Створення музики, аудіо та відео" },
                    { 11, "Сільське господарство та фермерство" },
                    { 12, "Сфера обслуговування (HoReCa, туризм, краса)" }
                });

            migrationBuilder.InsertData(
                table: "user_roles",
                columns: new[] { "Id", "ConcurrencyStamp", "Name", "NormalizedName" },
                values: new object[,]
                {
                    { 1, "b31b3294-13df-4740-9a3d-c1ef228229b4", "JobSeeker", "JOBSEEKER" },
                    { 2, "4d5e2365-5c1a-4ba9-8260-1e1de44cc966", "Employer", "EMPLOYER" },
                    { 3, "e8964319-21a4-49c8-89c0-96f3cf081045", "Admin", "ADMIN" }
                });

            migrationBuilder.InsertData(
                table: "locations",
                columns: new[] { "Id", "City", "RegionId" },
                values: new object[,]
                {
                    { 1, "Сімферополь", 1 },
                    { 2, "Ялта", 1 },
                    { 3, "Алушта", 1 },
                    { 4, "Євпаторія", 1 },
                    { 5, "Керч", 1 },
                    { 6, "Джанкой", 1 },
                    { 7, "Феодосія", 1 },
                    { 8, "Бахчисарай", 1 },
                    { 9, "Судак", 1 },
                    { 10, "Саки", 1 },
                    { 11, "Білогірськ", 1 },
                    { 12, "Армянськ", 1 },
                    { 13, "Красноперекопськ", 1 },
                    { 14, "Щолкіне", 1 },
                    { 15, "Старий Крим", 1 },
                    { 16, "Алупка", 1 },
                    { 17, "Чорноморське", 1 },
                    { 18, "Леніне", 1 },
                    { 19, "Нижньогірський", 1 },
                    { 20, "Красногвардійське", 1 },
                    { 21, "Кіровське", 1 },
                    { 22, "Совєтський", 1 },
                    { 23, "Роздольне", 1 },
                    { 24, "Первомайське", 1 },
                    { 25, "Гурзуф", 1 },
                    { 26, "Гаспра", 1 },
                    { 27, "Кореїз", 1 },
                    { 28, "Сімеїз", 1 },
                    { 29, "Форос", 1 },
                    { 30, "Масандра", 1 },
                    { 31, "Лівадія", 1 },
                    { 32, "Новий Світ", 1 },
                    { 33, "Коктебель", 1 },
                    { 34, "Миколаївка", 1 },
                    { 35, "Піщане", 1 },
                    { 36, "Міжводне", 1 },
                    { 37, "Оленівка", 1 },
                    { 38, "Заозерне", 1 },
                    { 39, "Попівка", 1 },
                    { 40, "Штормове", 1 },
                    { 41, "Чорнопілля", 1 },
                    { 42, "Зуя", 1 },
                    { 43, "Гресеський", 1 },
                    { 44, "Гвардійське", 1 },
                    { 45, "Укромне", 1 },
                    { 46, "Перове", 1 },
                    { 47, "Чистеньке", 1 },
                    { 48, "Добре", 1 },
                    { 49, "Зарічне", 1 },
                    { 50, "Перевальне", 1 },
                    { 51, "Вінниця", 2 },
                    { 52, "Жмеринка", 2 },
                    { 53, "Могилів-Подільський", 2 },
                    { 54, "Хмільник", 2 },
                    { 55, "Гайсин", 2 },
                    { 56, "Козятин", 2 },
                    { 57, "Ладижин", 2 },
                    { 58, "Калинівка", 2 },
                    { 59, "Бар", 2 },
                    { 60, "Тульчин", 2 },
                    { 61, "Бершадь", 2 },
                    { 62, "Гнівань", 2 },
                    { 63, "Немирів", 2 },
                    { 64, "Іллінці", 2 },
                    { 65, "Ямпіль", 2 },
                    { 66, "Погребище", 2 },
                    { 67, "Липовець", 2 },
                    { 68, "Шаргород", 2 },
                    { 69, "Томашпіль", 2 },
                    { 70, "Тростянець", 2 },
                    { 71, "Літин", 2 },
                    { 72, "Теплик", 2 },
                    { 73, "Тиврів", 2 },
                    { 74, "Крижопіль", 2 },
                    { 75, "Піщанка", 2 },
                    { 76, "Чечельник", 2 },
                    { 77, "Муровані Курилівці", 2 },
                    { 78, "Оратів", 2 },
                    { 79, "Чернівці (Вінн.)", 2 },
                    { 80, "Стрижавка", 2 },
                    { 81, "Вапнярка", 2 },
                    { 82, "Вендичани", 2 },
                    { 83, "Турбів", 2 },
                    { 84, "Сутиски", 2 },
                    { 85, "Шпиків", 2 },
                    { 86, "Ситківці", 2 },
                    { 87, "Брацлав", 2 },
                    { 88, "Дашів", 2 },
                    { 89, "Кирнасівка", 2 },
                    { 90, "Десна", 2 },
                    { 91, "Зарванці", 2 },
                    { 92, "Якушинці", 2 },
                    { 93, "Агрономічне", 2 },
                    { 94, "Бохоники", 2 },
                    { 95, "Писарівка", 2 },
                    { 96, "Сосонка", 2 },
                    { 97, "Лука-Мелешківська", 2 },
                    { 98, "Вінницькі Хутори", 2 },
                    { 99, "Махнівка", 2 },
                    { 100, "Корделівка", 2 },
                    { 101, "Луцьк", 3 },
                    { 102, "Ковель", 3 },
                    { 103, "Нововолинськ", 3 },
                    { 104, "Володимир", 3 },
                    { 105, "Ківерці", 3 },
                    { 106, "Рожище", 3 },
                    { 107, "Камінь-Каширський", 3 },
                    { 108, "Любомль", 3 },
                    { 109, "Горохів", 3 },
                    { 110, "Устилуг", 3 },
                    { 111, "Берестечко", 3 },
                    { 112, "Маневичі", 3 },
                    { 113, "Любешів", 3 },
                    { 114, "Ратне", 3 },
                    { 115, "Іваничі", 3 },
                    { 116, "Турійськ", 3 },
                    { 117, "Цумань", 3 },
                    { 118, "Стара Вижівка", 3 },
                    { 119, "Шацьк", 3 },
                    { 120, "Локачі", 3 },
                    { 121, "Торчин", 3 },
                    { 122, "Олика", 3 },
                    { 123, "Голоби", 3 },
                    { 124, "Заболоття", 3 },
                    { 125, "Колки", 3 },
                    { 126, "Мар'янівка", 3 },
                    { 127, "Дубище", 3 },
                    { 128, "Луків", 3 },
                    { 129, "Світязь", 3 },
                    { 130, "Згорани", 3 },
                    { 131, "Струмівка", 3 },
                    { 132, "Підгайці", 3 },
                    { 133, "Липини", 3 },
                    { 134, "Боратин", 3 },
                    { 135, "Рованці", 3 },
                    { 136, "Гірка Полонка", 3 },
                    { 137, "Забороль", 3 },
                    { 138, "Боголюби", 3 },
                    { 139, "Тарасове", 3 },
                    { 140, "Княгининок", 3 },
                    { 141, "Зміїнець", 3 },
                    { 142, "Сюрте", 3 },
                    { 143, "Жидичин", 3 },
                    { 144, "Прилуцьке", 3 },
                    { 145, "Крупа", 3 },
                    { 146, "Лище", 3 },
                    { 147, "Гаразджа", 3 },
                    { 148, "Маяки", 3 },
                    { 149, "Радомишль (Вол.)", 3 },
                    { 150, "Лаврів", 3 },
                    { 151, "Дніпро", 4 },
                    { 152, "Кривий Ріг", 4 },
                    { 153, "Кам'янське", 4 },
                    { 154, "Нікополь", 4 },
                    { 155, "Павлоград", 4 },
                    { 156, "Новомосковськ", 4 },
                    { 157, "Марганець", 4 },
                    { 158, "Жовті Води", 4 },
                    { 159, "Покров", 4 },
                    { 160, "Синельникове", 4 },
                    { 161, "Першотравенськ", 4 },
                    { 162, "Тернівка", 4 },
                    { 163, "Вільногірськ", 4 },
                    { 164, "Підгородне", 4 },
                    { 165, "П'ятихатки", 4 },
                    { 166, "Верхньодніпровськ", 4 },
                    { 167, "Апостолове", 4 },
                    { 168, "Зеленодольськ", 4 },
                    { 169, "Самар", 4 },
                    { 170, "Верхівцеве", 4 },
                    { 171, "Слобожанське", 4 },
                    { 172, "Царичанка", 4 },
                    { 173, "Магдалинівка", 4 },
                    { 174, "Петриківка", 4 },
                    { 175, "Кринички", 4 },
                    { 176, "Солоне", 4 },
                    { 177, "Томаківка", 4 },
                    { 178, "Широке", 4 },
                    { 179, "Софіївка", 4 },
                    { 180, "Межова", 4 },
                    { 181, "Покровське", 4 },
                    { 182, "Васильківка", 4 },
                    { 183, "Петропавлівка", 4 },
                    { 184, "Юр'ївка", 4 },
                    { 185, "Іларіонове", 4 },
                    { 186, "Карнаухівка", 4 },
                    { 187, "Аули", 4 },
                    { 188, "Новопокровка", 4 },
                    { 189, "Обухівка", 4 },
                    { 190, "Любимівка", 4 },
                    { 191, "Орлівщина", 4 },
                    { 192, "Піщанка", 4 },
                    { 193, "Гвардійське", 4 },
                    { 194, "Черкаське", 4 },
                    { 195, "Новоолександрівка", 4 },
                    { 196, "Волоське", 4 },
                    { 197, "Сурсько-Литовське", 4 },
                    { 198, "Лозуватка", 4 },
                    { 199, "Радушне", 4 },
                    { 200, "Божедарівка", 4 },
                    { 201, "Донецьк", 5 },
                    { 202, "Маріуполь", 5 },
                    { 203, "Макіївка", 5 },
                    { 204, "Горлівка", 5 },
                    { 205, "Краматорськ", 5 },
                    { 206, "Слов'янськ", 5 },
                    { 207, "Єнакієве", 5 },
                    { 208, "Бахмут", 5 },
                    { 209, "Костянтинівка", 5 },
                    { 210, "Покровськ", 5 },
                    { 211, "Дружківка", 5 },
                    { 212, "Харцизьк", 5 },
                    { 213, "Торез", 5 },
                    { 214, "Шахтарськ", 5 },
                    { 215, "Мирноград", 5 },
                    { 216, "Сніжне", 5 },
                    { 217, "Ясинувата", 5 },
                    { 218, "Авдіївка", 5 },
                    { 219, "Торецьк", 5 },
                    { 220, "Добропілля", 5 },
                    { 221, "Волноваха", 5 },
                    { 222, "Лиман", 5 },
                    { 223, "Селидове", 5 },
                    { 224, "Курахове", 5 },
                    { 225, "Докучаєвськ", 5 },
                    { 226, "Вугледар", 5 },
                    { 227, "Новогродівка", 5 },
                    { 228, "Білозерське", 5 },
                    { 229, "Мар'їнка", 5 },
                    { 230, "Сіверськ", 5 },
                    { 231, "Красногорівка", 5 },
                    { 232, "Українськ", 5 },
                    { 233, "Світлодарськ", 5 },
                    { 234, "Часів Яр", 5 },
                    { 235, "Гірник", 5 },
                    { 236, "Родинське", 5 },
                    { 237, "Святогірськ", 5 },
                    { 238, "Мангуш", 5 },
                    { 239, "Нікольське", 5 },
                    { 240, "Велика Новосілка", 5 },
                    { 241, "Олександрівка", 5 },
                    { 242, "Старобешеве", 5 },
                    { 243, "Тельманове", 5 },
                    { 244, "Новоазовськ", 5 },
                    { 245, "Сартана", 5 },
                    { 246, "Нью-Йорк", 5 },
                    { 247, "Оленівка", 5 },
                    { 248, "Більмацьке", 5 },
                    { 249, "Кліщіївка", 5 },
                    { 250, "Піски", 5 },
                    { 251, "Житомир", 6 },
                    { 252, "Бердичів", 6 },
                    { 253, "Коростень", 6 },
                    { 254, "Звягель", 6 },
                    { 255, "Малин", 6 },
                    { 256, "Коростишів", 6 },
                    { 257, "Овруч", 6 },
                    { 258, "Радомишль", 6 },
                    { 259, "Баранівка", 6 },
                    { 260, "Олевськ", 6 },
                    { 261, "Чуднів", 6 },
                    { 262, "Андрушівка", 6 },
                    { 263, "Черняхів", 6 },
                    { 264, "Попільня", 6 },
                    { 265, "Хорошів", 6 },
                    { 266, "Романів", 6 },
                    { 267, "Іршанськ", 6 },
                    { 268, "Ємільчине", 6 },
                    { 269, "Лугини", 6 },
                    { 270, "Пулини", 6 },
                    { 271, "Ружин", 6 },
                    { 272, "Любар", 6 },
                    { 273, "Брусилів", 6 },
                    { 274, "Народичі", 6 },
                    { 275, "Гришківці", 6 },
                    { 276, "Словечне", 6 },
                    { 277, "Довбиш", 6 },
                    { 278, "Першотравенськ (Жит.)", 6 },
                    { 279, "Сингаї", 6 },
                    { 280, "Нова Борова", 6 },
                    { 281, "Симони", 6 },
                    { 282, "Стрибіж", 6 },
                    { 283, "Зарічани", 6 },
                    { 284, "Станишівка", 6 },
                    { 285, "Тетерівка", 6 },
                    { 286, "Сінгури", 6 },
                    { 287, "Іванівка (Жит.)", 6 },
                    { 288, "Левків", 6 },
                    { 289, "Глибочиця", 6 },
                    { 290, "Оліївка", 6 },
                    { 291, "Клітчин", 6 },
                    { 292, "Вереси", 6 },
                    { 293, "Довжик", 6 },
                    { 294, "Барашівка", 6 },
                    { 295, "Кодня", 6 },
                    { 296, "Свитин", 6 },
                    { 297, "Бистрі", 6 },
                    { 298, "Корчак", 6 },
                    { 299, "Дениші", 6 },
                    { 300, "Висока Піч", 6 },
                    { 301, "Ужгород", 7 },
                    { 302, "Мукачево", 7 },
                    { 303, "Хуст", 7 },
                    { 304, "Берегове", 7 },
                    { 305, "Виноградів", 7 },
                    { 306, "Свалява", 7 },
                    { 307, "Рахів", 7 },
                    { 308, "Тячів", 7 },
                    { 309, "Іршава", 7 },
                    { 310, "Чоп", 7 },
                    { 311, "Міжгір'я", 7 },
                    { 312, "Великий Бичків", 7 },
                    { 313, "Дубове", 7 },
                    { 314, "Королево", 7 },
                    { 315, "Воловець", 7 },
                    { 316, "Буштино", 7 },
                    { 317, "Тересва", 7 },
                    { 318, "Вишково", 7 },
                    { 319, "Ясіня", 7 },
                    { 320, "Перечин", 7 },
                    { 321, "Великий Березний", 7 },
                    { 322, "Солотвино", 7 },
                    { 323, "Чинадійово", 7 },
                    { 324, "Батьово", 7 },
                    { 325, "Кольчино", 7 },
                    { 326, "Середнє", 7 },
                    { 327, "Усть-Чорна", 7 },
                    { 328, "Жденієво", 7 },
                    { 329, "Кваси", 7 },
                    { 330, "Поляна", 7 },
                    { 331, "Шаян", 7 },
                    { 332, "Пилипець", 7 },
                    { 333, "Ізки", 7 },
                    { 334, "Колочава", 7 },
                    { 335, "Синевир", 7 },
                    { 336, "Драгово", 7 },
                    { 337, "Іза", 7 },
                    { 338, "Нижнє Селище", 7 },
                    { 339, "Ділове", 7 },
                    { 340, "Богдан", 7 },
                    { 341, "Макарьово", 7 },
                    { 342, "Кленовець", 7 },
                    { 343, "Минай", 7 },
                    { 344, "Розівка", 7 },
                    { 345, "Сторожниця", 7 },
                    { 346, "Баранинці", 7 },
                    { 347, "Холмок", 7 },
                    { 348, "Коритняни", 7 },
                    { 349, "Оноківці", 7 },
                    { 350, "Кам'яниця", 7 },
                    { 351, "Запоріжжя", 8 },
                    { 352, "Мелітополь", 8 },
                    { 353, "Бердянськ", 8 },
                    { 354, "Енергодар", 8 },
                    { 355, "Токмак", 8 },
                    { 356, "Пологи", 8 },
                    { 357, "Дніпрорудне", 8 },
                    { 358, "Вільнянськ", 8 },
                    { 359, "Оріхів", 8 },
                    { 360, "Гуляйполе", 8 },
                    { 361, "Василівка", 8 },
                    { 362, "Кам'янка-Дніпровська", 8 },
                    { 363, "Михайлівка", 8 },
                    { 364, "Приморськ", 8 },
                    { 365, "Комишуваха", 8 },
                    { 366, "Якимівка", 8 },
                    { 367, "Кушугум", 8 },
                    { 368, "Веселе", 8 },
                    { 369, "Приазовське", 8 },
                    { 370, "Чернігівка", 8 },
                    { 371, "Новомиколаївка", 8 },
                    { 372, "Більмак", 8 },
                    { 373, "Розівка", 8 },
                    { 374, "Степногірськ", 8 },
                    { 375, "Балабине", 8 },
                    { 376, "Малокатеринівка", 8 },
                    { 377, "Молочанськ", 8 },
                    { 378, "Терпіння", 8 },
                    { 379, "Костянтинівка (Зап.)", 8 },
                    { 380, "Плодородне", 8 },
                    { 381, "Широке (Зап.)", 8 },
                    { 382, "Розумівка", 8 },
                    { 383, "Володимирівське", 8 },
                    { 384, "Біленьке", 8 },
                    { 385, "Нижня Хортиця", 8 },
                    { 386, "Бабурка", 8 },
                    { 387, "Нове Запоріжжя", 8 },
                    { 388, "Матвіївка", 8 },
                    { 389, "Наталівка", 8 },
                    { 390, "Степне", 8 },
                    { 391, "Лежине", 8 },
                    { 392, "Новоолександрівка (Зап.)", 8 },
                    { 393, "Григорівка", 8 },
                    { 394, "Юрківка", 8 },
                    { 395, "Таврійське", 8 },
                    { 396, "Кам'янське (Зап.)", 8 },
                    { 397, "Новобогданівка", 8 },
                    { 398, "Спаське", 8 },
                    { 399, "Новгородківка", 8 },
                    { 400, "Вознесенка", 8 },
                    { 401, "Івано-Франківськ", 9 },
                    { 402, "Калуш", 9 },
                    { 403, "Коломия", 9 },
                    { 404, "Надвірна", 9 },
                    { 405, "Долина", 9 },
                    { 406, "Бурштин", 9 },
                    { 407, "Косів", 9 },
                    { 408, "Снятин", 9 },
                    { 409, "Рогатин", 9 },
                    { 410, "Тлумач", 9 },
                    { 411, "Городенка", 9 },
                    { 412, "Тисмениця", 9 },
                    { 413, "Галич", 9 },
                    { 414, "Болехів", 9 },
                    { 415, "Яремче", 9 },
                    { 416, "Богородчани", 9 },
                    { 417, "Рожнятів", 9 },
                    { 418, "Ланчин", 9 },
                    { 419, "Верховина", 9 },
                    { 420, "Делятин", 9 },
                    { 421, "Перегінське", 9 },
                    { 422, "Печеніжин", 9 },
                    { 423, "Заболотів", 9 },
                    { 424, "Отинія", 9 },
                    { 425, "Брошнів-Осада", 9 },
                    { 426, "Кути", 9 },
                    { 427, "Букачівці", 9 },
                    { 428, "Войнилів", 9 },
                    { 429, "Битків", 9 },
                    { 430, "Солотвин", 9 },
                    { 431, "Ворохта", 9 },
                    { 432, "Яблуниця", 9 },
                    { 433, "Поляниця (Буковель)", 9 },
                    { 434, "Микуличин", 9 },
                    { 435, "Татарів", 9 },
                    { 436, "Криворівня", 9 },
                    { 437, "Дземброня", 9 },
                    { 438, "Вовчинець", 9 },
                    { 439, "Крихівці", 9 },
                    { 440, "Чукалівка", 9 },
                    { 441, "Угорники", 9 },
                    { 442, "Микитинці", 9 },
                    { 443, "Хриплин", 9 },
                    { 444, "Черніїв", 9 },
                    { 445, "Угринів", 9 },
                    { 446, "Клузів", 9 },
                    { 447, "Павлівка", 9 },
                    { 448, "Старий Лисець", 9 },
                    { 449, "Лисець", 9 },
                    { 450, "Загвіздя", 9 },
                    { 451, "Біла Церква", 10 },
                    { 452, "Бровари", 10 },
                    { 453, "Ірпінь", 10 },
                    { 454, "Бориспіль", 10 },
                    { 455, "Фастів", 10 },
                    { 456, "Вишневе", 10 },
                    { 457, "Васильків", 10 },
                    { 458, "Боярка", 10 },
                    { 459, "Обухів", 10 },
                    { 460, "Буча", 10 },
                    { 461, "Вишгород", 10 },
                    { 462, "Переяслав", 10 },
                    { 463, "Славутич", 10 },
                    { 464, "Яготин", 10 },
                    { 465, "Богуслав", 10 },
                    { 466, "Сквира", 10 },
                    { 467, "Березань", 10 },
                    { 468, "Українка", 10 },
                    { 469, "Коцюбинське", 10 },
                    { 470, "Гостомель", 10 },
                    { 471, "Тетіїв", 10 },
                    { 472, "Кагарлик", 10 },
                    { 473, "Миронівка", 10 },
                    { 474, "Тараща", 10 },
                    { 475, "Макарів", 10 },
                    { 476, "Іванків", 10 },
                    { 477, "Баришівка", 10 },
                    { 478, "Рокитне", 10 },
                    { 479, "Ставище", 10 },
                    { 480, "Згурівка", 10 },
                    { 481, "Бородянка", 10 },
                    { 482, "Володарка", 10 },
                    { 483, "Гребінки", 10 },
                    { 484, "Димер", 10 },
                    { 485, "Красятичі", 10 },
                    { 486, "Софіївська Борщагівка", 10 },
                    { 487, "Петропавлівська Борщагівка", 10 },
                    { 488, "Чайки", 10 },
                    { 489, "Крюківщина", 10 },
                    { 490, "Тарасівка", 10 },
                    { 491, "Гатне", 10 },
                    { 492, "Чабани", 10 },
                    { 493, "Новосілки", 10 },
                    { 494, "Хотів", 10 },
                    { 495, "Святопетрівське", 10 },
                    { 496, "Білогородка", 10 },
                    { 497, "Гореничі", 10 },
                    { 498, "Стоянка", 10 },
                    { 499, "Погреби", 10 },
                    { 500, "Зазим'є", 10 },
                    { 501, "Кропивницький", 11 },
                    { 502, "Олександрія", 11 },
                    { 503, "Світловодськ", 11 },
                    { 504, "Знам'янка", 11 },
                    { 505, "Новоукраїнка", 11 },
                    { 506, "Долинська", 11 },
                    { 507, "Гайворон", 11 },
                    { 508, "Новомиргород", 11 },
                    { 509, "Бобринець", 11 },
                    { 510, "Мала Виска", 11 },
                    { 511, "Благовіщенське", 11 },
                    { 512, "Помічна", 11 },
                    { 513, "Олександрівка (Кіров.)", 11 },
                    { 514, "Добровеличківка", 11 },
                    { 515, "Голованівськ", 11 },
                    { 516, "Новгородка", 11 },
                    { 517, "Онуфріївка", 11 },
                    { 518, "Компаніївка", 11 },
                    { 519, "Устинівка", 11 },
                    { 520, "Вільшанка", 11 },
                    { 521, "Смоліне", 11 },
                    { 522, "Пантаївка", 11 },
                    { 523, "Знам'янка Друга", 11 },
                    { 524, "Соколівське", 11 },
                    { 525, "Велике Озеро", 11 },
                    { 526, "Грузьке", 11 },
                    { 527, "Первозванівка", 11 },
                    { 528, "Клинці", 11 },
                    { 529, "Катеринівка", 11 },
                    { 530, "Обознівка", 11 },
                    { 531, "Аджамка", 11 },
                    { 532, "Нове", 11 },
                    { 533, "Суботці", 11 },
                    { 534, "Трепівка", 11 },
                    { 535, "Дмитрівка", 11 },
                    { 536, "Цибулеве", 11 },
                    { 537, "Богданівка", 11 },
                    { 538, "Павлиш", 11 },
                    { 539, "Косівка", 11 },
                    { 540, "Приютівка", 11 },
                    { 541, "Нова Прага", 11 },
                    { 542, "Диківка", 11 },
                    { 543, "Червона Кам'янка", 11 },
                    { 544, "Попельнасте", 11 },
                    { 545, "Куколівка", 11 },
                    { 546, "Побузьке", 11 },
                    { 547, "Завалля", 11 },
                    { 548, "Хащувате", 11 },
                    { 549, "Йосипівка", 11 },
                    { 550, "Підвисоке", 11 },
                    { 551, "Луганськ", 12 },
                    { 552, "Сєвєродонецьк", 12 },
                    { 553, "Алчевськ", 12 },
                    { 554, "Лисичанськ", 12 },
                    { 555, "Хрустальний", 12 },
                    { 556, "Кадіївка", 12 },
                    { 557, "Довжанськ", 12 },
                    { 558, "Рубіжне", 12 },
                    { 559, "Антрацит", 12 },
                    { 560, "Ровеньки", 12 },
                    { 561, "Брянка", 12 },
                    { 562, "Сорокине", 12 },
                    { 563, "Голубівка", 12 },
                    { 564, "Первомайськ", 12 },
                    { 565, "Попасна", 12 },
                    { 566, "Сватове", 12 },
                    { 567, "Кремінна", 12 },
                    { 568, "Старобільськ", 12 },
                    { 569, "Суходільськ", 12 },
                    { 570, "Золоте", 12 },
                    { 571, "Гірське", 12 },
                    { 572, "Петрово-Красносілля", 12 },
                    { 573, "Щастя", 12 },
                    { 574, "Станиця Луганська", 12 },
                    { 575, "Біловодськ", 12 },
                    { 576, "Марківка", 12 },
                    { 577, "Новопсков", 12 },
                    { 578, "Білокуракине", 12 },
                    { 579, "Троїцьке", 12 },
                    { 580, "Мілове", 12 },
                    { 581, "Новоайдар", 12 },
                    { 582, "Слов'яносербськ", 12 },
                    { 583, "Лутугине", 12 },
                    { 584, "Перевальськ", 12 },
                    { 585, "Зоринськ", 12 },
                    { 586, "Алмазна", 12 },
                    { 587, "Олександрівськ", 12 },
                    { 588, "Зимогір'я", 12 },
                    { 589, "Артемівськ", 12 },
                    { 590, "Борівське", 12 },
                    { 591, "Метьолкіне", 12 },
                    { 592, "Сиротине", 12 },
                    { 593, "Новотошківське", 12 },
                    { 594, "Нижнє", 12 },
                    { 595, "Кримське", 12 },
                    { 596, "Трьохізбенка", 12 },
                    { 597, "Широкий", 12 },
                    { 598, "Ювілейне", 12 },
                    { 599, "Біле", 12 },
                    { 600, "Успенка", 12 },
                    { 601, "Львів", 13 },
                    { 602, "Дрогобич", 13 },
                    { 603, "Червоноград", 13 },
                    { 604, "Стрий", 13 },
                    { 605, "Самбір", 13 },
                    { 606, "Борислав", 13 },
                    { 607, "Новояворівськ", 13 },
                    { 608, "Трускавець", 13 },
                    { 609, "Новий Розділ", 13 },
                    { 610, "Золочів", 13 },
                    { 611, "Броди", 13 },
                    { 612, "Сокаль", 13 },
                    { 613, "Стебник", 13 },
                    { 614, "Городок (Львів.)", 13 },
                    { 615, "Миколаїв (Львів.)", 13 },
                    { 616, "Жовква", 13 },
                    { 617, "Яворів", 13 },
                    { 618, "Соснівка", 13 },
                    { 619, "Кам'янка-Бузька", 13 },
                    { 620, "Жидачів", 13 },
                    { 621, "Пустомити", 13 },
                    { 622, "Ходорів", 13 },
                    { 623, "Радехів", 13 },
                    { 624, "Мостиська", 13 },
                    { 625, "Буськ", 13 },
                    { 626, "Турка", 13 },
                    { 627, "Рава-Руська", 13 },
                    { 628, "Старий Самбір", 13 },
                    { 629, "Сколе", 13 },
                    { 630, "Славське", 13 },
                    { 631, "Моршин", 13 },
                    { 632, "Сокільники", 13 },
                    { 633, "Зимна Вода", 13 },
                    { 634, "Рудне", 13 },
                    { 635, "Лапаївка", 13 },
                    { 636, "Брюховичі", 13 },
                    { 637, "Винники", 13 },
                    { 638, "Пасіки-Зубрицькі", 13 },
                    { 639, "Зубра", 13 },
                    { 640, "Муроване", 13 },
                    { 641, "Рясне-Руське", 13 },
                    { 642, "Конопниця", 13 },
                    { 643, "Малехів", 13 },
                    { 644, "Дубляни", 13 },
                    { 645, "Липники", 13 },
                    { 646, "Поршна", 13 },
                    { 647, "Оброшине", 13 },
                    { 648, "Скнилів", 13 },
                    { 649, "Солонка", 13 },
                    { 650, "Бірки", 13 },
                    { 651, "Миколаїв", 14 },
                    { 652, "Первомайськ (Мик.)", 14 },
                    { 653, "Южноукраїнськ", 14 },
                    { 654, "Вознесенськ", 14 },
                    { 655, "Новий Буг", 14 },
                    { 656, "Очаків", 14 },
                    { 657, "Снігурівка", 14 },
                    { 658, "Баштанка", 14 },
                    { 659, "Нова Одеса", 14 },
                    { 660, "Врадіївка", 14 },
                    { 661, "Криве Озеро", 14 },
                    { 662, "Березанка", 14 },
                    { 663, "Арбузинка", 14 },
                    { 664, "Веселинове", 14 },
                    { 665, "Казанка", 14 },
                    { 666, "Доманівка", 14 },
                    { 667, "Єланець", 14 },
                    { 668, "Братське", 14 },
                    { 669, "Ольшанське", 14 },
                    { 670, "Воскресенське", 14 },
                    { 671, "Коблеве", 14 },
                    { 672, "Кінбурнська коса", 14 },
                    { 673, "Мішково-Погорілове", 14 },
                    { 674, "Калинівка (Мик.)", 14 },
                    { 675, "Воскресенськ", 14 },
                    { 676, "Сливине", 14 },
                    { 677, "Надбузьке", 14 },
                    { 678, "Весняне", 14 },
                    { 679, "Матвіївка", 14 },
                    { 680, "Тернівка (Мик.)", 14 },
                    { 681, "Баловне", 14 },
                    { 682, "Костянтинівка (Мик.)", 14 },
                    { 683, "Шевченкове (Мик.)", 14 },
                    { 684, "Зелений Гай", 14 },
                    { 685, "Радсад", 14 },
                    { 686, "Степове", 14 },
                    { 687, "Мигія", 14 },
                    { 688, "Синюхин Брід", 14 },
                    { 689, "Лиса Гора", 14 },
                    { 690, "Кінецьпіль", 14 },
                    { 691, "Благодатне", 14 },
                    { 692, "Семенівка", 14 },
                    { 693, "Трикрати", 14 },
                    { 694, "Актове", 14 },
                    { 695, "Олександрівка (Возн.)", 14 },
                    { 696, "Прибужани", 14 },
                    { 697, "Бузьке", 14 },
                    { 698, "Гур'ївка", 14 },
                    { 699, "Добре", 14 },
                    { 700, "Полігон", 14 },
                    { 701, "Одеса", 15 },
                    { 702, "Ізмаїл", 15 },
                    { 703, "Чорноморськ", 15 },
                    { 704, "Білгород-Дністровський", 15 },
                    { 705, "Подільськ", 15 },
                    { 706, "Південне (Южне)", 15 },
                    { 707, "Кілія", 15 },
                    { 708, "Рені", 15 },
                    { 709, "Балта", 15 },
                    { 710, "Роздільна", 15 },
                    { 711, "Болград", 15 },
                    { 712, "Арциз", 15 },
                    { 713, "Біляївка", 15 },
                    { 714, "Татарбунари", 15 },
                    { 715, "Теплодар", 15 },
                    { 716, "Березівка", 15 },
                    { 717, "Кодима", 15 },
                    { 718, "Ананьїв", 15 },
                    { 719, "Вилкове", 15 },
                    { 720, "Овідіополь", 15 },
                    { 721, "Доброслав", 15 },
                    { 722, "Любашівка", 15 },
                    { 723, "Ширяєве", 15 },
                    { 724, "Саврань", 15 },
                    { 725, "Тарутине", 15 },
                    { 726, "Сарата", 15 },
                    { 727, "Затока", 15 },
                    { 728, "Кароліно-Бугаз", 15 },
                    { 729, "Сергіївка", 15 },
                    { 730, "Крижанівка", 15 },
                    { 731, "Фонтанка", 15 },
                    { 732, "Авангард", 15 },
                    { 733, "Таїрове", 15 },
                    { 734, "Чорноморське (Од.)", 15 },
                    { 735, "Нова Долина", 15 },
                    { 736, "Великодолинське", 15 },
                    { 737, "Прилиманське", 15 },
                    { 738, "Сухий Лиман", 15 },
                    { 739, "Нерубайське", 15 },
                    { 740, "Усатове", 15 },
                    { 741, "Дачне", 15 },
                    { 742, "Холодна Балка", 15 },
                    { 743, "Алтестове", 15 },
                    { 744, "Куяльник", 15 },
                    { 745, "Латовка", 15 },
                    { 746, "Іллічанка", 15 },
                    { 747, "Красносілка", 15 },
                    { 748, "Олександрівка (Од.)", 15 },
                    { 749, "Маяки", 15 },
                    { 750, "Троїцьке", 15 },
                    { 751, "Полтава", 16 },
                    { 752, "Кременчук", 16 },
                    { 753, "Горішні Плавні", 16 },
                    { 754, "Лубни", 16 },
                    { 755, "Миргород", 16 },
                    { 756, "Гадяч", 16 },
                    { 757, "Пирятин", 16 },
                    { 758, "Карлівка", 16 },
                    { 759, "Хорол", 16 },
                    { 760, "Котельва", 16 },
                    { 761, "Лохвиця", 16 },
                    { 762, "Глобине", 16 },
                    { 763, "Гребінка", 16 },
                    { 764, "Кобеляки", 16 },
                    { 765, "Зіньків", 16 },
                    { 766, "Решетилівка", 16 },
                    { 767, "Заводське", 16 },
                    { 768, "Диканька", 16 },
                    { 769, "Нові Санжари", 16 },
                    { 770, "Шишаки", 16 },
                    { 771, "Чутове", 16 },
                    { 772, "Опішня", 16 },
                    { 773, "Козельщина", 16 },
                    { 774, "Семенівка (Полт.)", 16 },
                    { 775, "Машівка", 16 },
                    { 776, "Оржиця", 16 },
                    { 777, "Чорнухи", 16 },
                    { 778, "Розсошенці", 16 },
                    { 779, "Щербані", 16 },
                    { 780, "Терешки", 16 },
                    { 781, "Супрунівка", 16 },
                    { 782, "Гожули", 16 },
                    { 783, "Абазівка", 16 },
                    { 784, "Копили", 16 },
                    { 785, "Мачухи", 16 },
                    { 786, "Степне", 16 },
                    { 787, "Великі Сорочинці", 16 },
                    { 788, "Білоцерківка", 16 },
                    { 789, "КраКрасногорівка", 16 },
                    { 790, "Піщане (Полт.)", 16 },
                    { 791, "Кам'яні Потоки", 16 },
                    { 792, "Омельник", 16 },
                    { 793, "Білецьківка", 16 },
                    { 794, "Потоки", 16 },
                    { 795, "Градизьк", 16 },
                    { 796, "Недогарки", 16 },
                    { 797, "Максимівка", 16 },
                    { 798, "Велика Багачка", 16 },
                    { 799, "Яреськи", 16 },
                    { 800, "Гоголеве", 16 },
                    { 801, "Рівне", 17 },
                    { 802, "Вараш", 17 },
                    { 803, "Дубно", 17 },
                    { 804, "Костопіль", 17 },
                    { 805, "Сарни", 17 },
                    { 806, "Здолбунів", 17 },
                    { 807, "Острог", 17 },
                    { 808, "Березне", 17 },
                    { 809, "Радивилів", 17 },
                    { 810, "Дубровиця", 17 },
                    { 811, "Корець", 17 },
                    { 812, "Володимирець", 17 },
                    { 813, "Клевань", 17 },
                    { 814, "Рокитне (Рівн.)", 17 },
                    { 815, "Млинів", 17 },
                    { 816, "Гоща", 17 },
                    { 817, "Зарічне", 17 },
                    { 818, "Квасилів", 17 },
                    { 819, "Степань", 17 },
                    { 820, "Оржів", 17 },
                    { 821, "Демидівка", 17 },
                    { 822, "Смига", 17 },
                    { 823, "Томашгород", 17 },
                    { 824, "Соснове", 17 },
                    { 825, "Мізоч", 17 },
                    { 826, "Великий Житин", 17 },
                    { 827, "Городок (Рівн.)", 17 },
                    { 828, "Біла Криниця", 17 },
                    { 829, "Корнин", 17 },
                    { 830, "Колоденка", 17 },
                    { 831, "Обарів", 17 },
                    { 832, "Тайкури", 17 },
                    { 833, "Шпанів", 17 },
                    { 834, "Зоря", 17 },
                    { 835, "Олександрія (Рівн.)", 17 },
                    { 836, "Любомирка", 17 },
                    { 837, "Нова Любомирка", 17 },
                    { 838, "Радухівка", 17 },
                    { 839, "Шубків", 17 },
                    { 840, "Тучин", 17 },
                    { 841, "Грушвиця Перша", 17 },
                    { 842, "Дядьковичі", 17 },
                    { 843, "Верхівськ", 17 },
                    { 844, "Здовбиця", 17 },
                    { 845, "Гільча Друга", 17 },
                    { 846, "Урвенна", 17 },
                    { 847, "Тараканів", 17 },
                    { 848, "Панталія", 17 },
                    { 849, "Привільне", 17 },
                    { 850, "Верба", 17 },
                    { 851, "Суми", 18 },
                    { 852, "Конотоп", 18 },
                    { 853, "Шостка", 18 },
                    { 854, "Охтирка", 18 },
                    { 855, "Ромни", 18 },
                    { 856, "Глухів", 18 },
                    { 857, "Лебедин", 18 },
                    { 858, "Кролевець", 18 },
                    { 859, "Тростянець (Сум.)", 18 },
                    { 860, "Білопілля", 18 },
                    { 861, "Путивль", 18 },
                    { 862, "Буринь", 18 },
                    { 863, "Краснопілля", 18 },
                    { 864, "Середина-Буда", 18 },
                    { 865, "Ворожба", 18 },
                    { 866, "Свеса", 18 },
                    { 867, "Недригайлів", 18 },
                    { 868, "Степанівка", 18 },
                    { 869, "Липова Долина", 18 },
                    { 870, "Ямпіль (Сум.)", 18 },
                    { 871, "Зноб-Новгородське", 18 },
                    { 872, "Велика Писарівка", 18 },
                    { 873, "Кириківка", 18 },
                    { 874, "Низи", 18 },
                    { 875, "Хотінь", 18 },
                    { 876, "Угроїди", 18 },
                    { 877, "Сад", 18 },
                    { 878, "Косівщина", 18 },
                    { 879, "Стецьківка", 18 },
                    { 880, "Верхня Сироватка", 18 },
                    { 881, "Нижня Сироватка", 18 },
                    { 882, "Бездрик", 18 },
                    { 883, "Токарі", 18 },
                    { 884, "Великий Чернеччина", 18 },
                    { 885, "Миколаївка (Сум.)", 18 },
                    { 886, "Боромля", 18 },
                    { 887, "Глибне", 18 },
                    { 888, "Червоне", 18 },
                    { 889, "Симівка", 18 },
                    { 890, "Пушкарівка", 18 },
                    { 891, "Річки", 18 },
                    { 892, "Вири", 18 },
                    { 893, "Миропілля", 18 },
                    { 894, "Юнаківка", 18 },
                    { 895, "Хмелів", 18 },
                    { 896, "Андріяшівка", 18 },
                    { 897, "Сміле", 18 },
                    { 898, "Коровинці", 18 },
                    { 899, "Терни", 18 },
                    { 900, "Дубов'язівка", 18 },
                    { 901, "Тернопіль", 19 },
                    { 902, "Чортків", 19 },
                    { 903, "Кременець", 19 },
                    { 904, "Бережани", 19 },
                    { 905, "Збараж", 19 },
                    { 906, "Теребовля", 19 },
                    { 907, "Бучач", 19 },
                    { 908, "Борщів", 19 },
                    { 909, "Заліщики", 19 },
                    { 910, "Козова", 19 },
                    { 911, "Ланівці", 19 },
                    { 912, "Зборів", 19 },
                    { 913, "Підволочиськ", 19 },
                    { 914, "Шумськ", 19 },
                    { 915, "Почаїв", 19 },
                    { 916, "Хоростків", 19 },
                    { 917, "Копичинці", 19 },
                    { 918, "Монастириська", 19 },
                    { 919, "Гусятин", 19 },
                    { 920, "Підгайці", 19 },
                    { 921, "Скала-Подільська", 19 },
                    { 922, "Микулинці", 19 },
                    { 923, "Товсте", 19 },
                    { 924, "Вишнівець", 19 },
                    { 925, "Велика Березовиця", 19 },
                    { 926, "Великі Гаї", 19 },
                    { 927, "Біла (Терн.)", 19 },
                    { 928, "Байківці", 19 },
                    { 929, "Смиківці", 19 },
                    { 930, "Петриків", 19 },
                    { 931, "Підгородне (Терн.)", 19 },
                    { 932, "Острів", 19 },
                    { 933, "Буцнів", 19 },
                    { 934, "Ступки", 19 },
                    { 935, "Романівка", 19 },
                    { 936, "Плотича", 19 },
                    { 937, "Івачів Долішній", 19 },
                    { 938, "Залізці", 19 },
                    { 939, "Гримайлів", 19 },
                    { 940, "Мельниця-Подільська", 19 },
                    { 941, "Золотий Потік", 19 },
                    { 942, "Коропець", 19 },
                    { 943, "Дружба", 19 },
                    { 944, "Заводське", 19 },
                    { 945, "Ягільниця", 19 },
                    { 946, "Білобожниця", 19 },
                    { 947, "Озеряни", 19 },
                    { 948, "Смотрич", 19 },
                    { 949, "Бабинці", 19 },
                    { 950, "Кривче", 19 },
                    { 951, "Харків", 20 },
                    { 952, "Лозова", 20 },
                    { 953, "Ізюм", 20 },
                    { 954, "Чугуїв", 20 },
                    { 955, "Первомайський", 20 },
                    { 956, "Балаклія", 20 },
                    { 957, "Куп'янськ", 20 },
                    { 958, "Пісочин", 20 },
                    { 959, "Мерефа", 20 },
                    { 960, "Люботин", 20 },
                    { 961, "Красноград", 20 },
                    { 962, "Вовчанськ", 20 },
                    { 963, "Дергачі", 20 },
                    { 964, "Зміїв", 20 },
                    { 965, "Богодухів", 20 },
                    { 966, "Барвінкове", 20 },
                    { 967, "Валки", 20 },
                    { 968, "Південне", 20 },
                    { 969, "Нова Водолага", 20 },
                    { 970, "Високий", 20 },
                    { 971, "Солоницівка", 20 },
                    { 972, "Покотилівка", 20 },
                    { 973, "Безлюдівка", 20 },
                    { 974, "Рогань", 20 },
                    { 975, "Коротич", 20 },
                    { 976, "Бабаї", 20 },
                    { 977, "Хорошеве", 20 },
                    { 978, "Васищеве", 20 },
                    { 979, "Мала Данилівка", 20 },
                    { 980, "Пересічне", 20 },
                    { 981, "Вільшани", 20 },
                    { 982, "Золочів (Харк.)", 20 },
                    { 983, "Кегичівка", 20 },
                    { 984, "Сахновщина", 20 },
                    { 985, "Зачепилівка", 20 },
                    { 986, "Краснокутськ", 20 },
                    { 987, "Коломак", 20 },
                    { 988, "Шевченкове", 20 },
                    { 989, "Дворічна", 20 },
                    { 990, "Великий Бурлук", 20 },
                    { 991, "Печеніги", 20 },
                    { 992, "Малинівка", 20 },
                    { 993, "Кочеток", 20 },
                    { 994, "Введенка", 20 },
                    { 995, "Новопокровка (Харк.)", 20 },
                    { 996, "Есхар", 20 },
                    { 997, "Слобожанське (Харк.)", 20 },
                    { 998, "Андріївка", 20 },
                    { 999, "Савинці", 20 },
                    { 1000, "Донець", 20 },
                    { 1001, "Херсон", 21 },
                    { 1002, "Нова Каховка", 21 },
                    { 1003, "Каховка", 21 },
                    { 1004, "Олешки", 21 },
                    { 1005, "Генічеськ", 21 },
                    { 1006, "Скадовськ", 21 },
                    { 1007, "Гола Пристань", 21 },
                    { 1008, "Берислав", 21 },
                    { 1009, "Таврійськ", 21 },
                    { 1010, "Чаплинка", 21 },
                    { 1011, "Білозерка", 21 },
                    { 1012, "Новотроїцьке", 21 },
                    { 1013, "Каланчак", 21 },
                    { 1014, "Велика Лепетиха", 21 },
                    { 1015, "Нововоронцовка", 21 },
                    { 1016, "Іванівка", 21 },
                    { 1017, "Горностаївка", 21 },
                    { 1018, "Ни Нижні Сірогози", 21 },
                    { 1019, "Високопілля", 21 },
                    { 1020, "Велика Олександрівка", 21 },
                    { 1021, "Чорнобаївка", 21 },
                    { 1022, "Антонівка", 21 },
                    { 1023, "Степанівка", 21 },
                    { 1024, "Зеленівка", 21 },
                    { 1025, "Наддніпрянське", 21 },
                    { 1026, "Комишани", 21 },
                    { 1027, "Музиківка", 21 },
                    { 1028, "Дар'ївка", 21 },
                    { 1029, "Станіслав", 21 },
                    { 1030, "Широка Балка", 21 },
                    { 1031, "Олександрівка (Херс.)", 21 },
                    { 1032, "Рибальче", 21 },
                    { 1033, "Чулаківка", 21 },
                    { 1034, "Бехтери", 21 },
                    { 1035, "Залізний Порт", 21 },
                    { 1036, "Лазурне", 21 },
                    { 1037, "Красне", 21 },
                    { 1038, "Брилівка", 21 },
                    { 1039, "Тарасівка", 21 },
                    { 1040, "Нова Маячка", 21 },
                    { 1041, "Абрикосівка", 21 },
                    { 1042, "Раденськ", 21 },
                    { 1043, "Великі Копані", 21 },
                    { 1044, "Козачі Лагері", 21 },
                    { 1045, "Кринки", 21 },
                    { 1046, "Корсунка", 21 },
                    { 1047, "Дніпряни", 21 },
                    { 1048, "Основа", 21 },
                    { 1049, "Любимівка (Херс.)", 21 },
                    { 1050, "Чорнянка", 21 },
                    { 1051, "Хмельницький", 22 },
                    { 1052, "Кам'янець-Подільський", 22 },
                    { 1053, "Шепетівка", 22 },
                    { 1054, "Нетішин", 22 },
                    { 1055, "Славута", 22 },
                    { 1056, "Старокостянтинів", 22 },
                    { 1057, "Полонне", 22 },
                    { 1058, "Красилів", 22 },
                    { 1059, "Волочиськ", 22 },
                    { 1060, "Ізяслав", 22 },
                    { 1061, "Дунаївці", 22 },
                    { 1062, "Летичів", 22 },
                    { 1063, "Деражня", 22 },
                    { 1064, "Ярмолинці", 22 },
                    { 1065, "Городок (Хмел.)", 22 },
                    { 1066, "Чемерівці", 22 },
                    { 1067, "Нова Ушиця", 22 },
                    { 1068, "Теофіполь", 22 },
                    { 1069, "Віньківці", 22 },
                    { 1070, "Білогір'я", 22 },
                    { 1071, "Стара Синява", 22 },
                    { 1072, "Ружична", 22 },
                    { 1073, "Олешин", 22 },
                    { 1074, "Лісові Гринівці", 22 },
                    { 1075, "Стуфчинці", 22 },
                    { 1076, "Шаровечка", 22 },
                    { 1077, "Мацьківці", 22 },
                    { 1078, "Копистин", 22 },
                    { 1079, "Богданівці", 22 },
                    { 1080, "Давидківці", 22 },
                    { 1081, "Гвардійське", 22 },
                    { 1082, "Смотрич", 22 },
                    { 1083, "Балин", 22 },
                    { 1084, "Довжок", 22 },
                    { 1085, "Жванець", 22 },
                    { 1086, "Оринин", 22 },
                    { 1087, "Сатанів", 22 },
                    { 1088, "Гриців", 22 },
                    { 1089, "Судилків", 22 },
                    { 1090, "Михайлючка", 22 },
                    { 1091, "Плужне", 22 },
                    { 1092, "Ганнопіль", 22 },
                    { 1093, "Базалія", 22 },
                    { 1094, "Наркевичі", 22 },
                    { 1095, "Чорний Острів", 22 },
                    { 1096, "Війтівці", 22 },
                    { 1097, "Лозова (Хмел.)", 22 },
                    { 1098, "Вовковинці", 22 },
                    { 1099, "Самчики", 22 },
                    { 1100, "Антоніни", 22 },
                    { 1101, "Черкаси", 23 },
                    { 1102, "Умань", 23 },
                    { 1103, "Сміла", 23 },
                    { 1104, "Золотоноша", 23 },
                    { 1105, "Канів", 23 },
                    { 1106, "Звенигородка", 23 },
                    { 1107, "Корсунь-Шевченківський", 23 },
                    { 1108, "Шпола", 23 },
                    { 1109, "Ватутіне", 23 },
                    { 1110, "Жашків", 23 },
                    { 1111, "Городище", 23 },
                    { 1112, "Тальне", 23 },
                    { 1113, "Кам'янка", 23 },
                    { 1114, "Христинівка", 23 },
                    { 1115, "Монастирище", 23 },
                    { 1116, "Чигирин", 23 },
                    { 1117, "Маньківка", 23 },
                    { 1118, "Чорнобай", 23 },
                    { 1119, "Лисянка", 23 },
                    { 1120, "Драбів", 23 },
                    { 1121, "Катеринопіль", 23 },
                    { 1122, "Червона Слобода", 23 },
                    { 1123, "Руська Поляна", 23 },
                    { 1124, "Геронимівка", 23 },
                    { 1125, "Білозір'я", 23 },
                    { 1126, "Дубіївка", 23 },
                    { 1127, "Свидівок", 23 },
                    { 1128, "Мошни", 23 },
                    { 1129, "Будище", 23 },
                    { 1130, "Степанки", 23 },
                    { 1131, "Хацьки", 23 },
                    { 1132, "Вергуни", 23 },
                    { 1133, "Леськи", 23 },
                    { 1134, "Хутори", 23 },
                    { 1135, "Сагунівка", 23 },
                    { 1136, "Благодатне", 23 },
                    { 1137, "Деньги", 23 },
                    { 1138, "Піщане", 23 },
                    { 1139, "Гельмязів", 23 },
                    { 1140, "Іркліїв", 23 },
                    { 1141, "Стеблів", 23 },
                    { 1142, "Моринці", 23 },
                    { 1143, "Шевченкове", 23 },
                    { 1144, "Суботів", 23 },
                    { 1145, "Медведівка", 23 },
                    { 1146, "Бабанка", 23 },
                    { 1147, "Іваньки", 23 },
                    { 1148, "Буки", 23 },
                    { 1149, "Соколівка", 23 },
                    { 1150, "Цибулів", 23 },
                    { 1151, "Чернівці", 24 },
                    { 1152, "Сторожинець", 24 },
                    { 1153, "Новодністровськ", 24 },
                    { 1154, "Хотин", 24 },
                    { 1155, "Сокиряни", 24 },
                    { 1156, "Заставна", 24 },
                    { 1157, "Кельменці", 24 },
                    { 1158, "Глибока", 24 },
                    { 1159, "Новоселиця", 24 },
                    { 1160, "Кіцмань", 24 },
                    { 1161, "Вижниця", 24 },
                    { 1162, "Герца", 24 },
                    { 1163, "Путила", 24 },
                    { 1164, "Вашківці", 24 },
                    { 1165, "Берегомет", 24 },
                    { 1166, "Красноїльськ", 24 },
                    { 1167, "Лужани", 24 },
                    { 1168, "Неполоківці", 24 },
                    { 1169, "Кострижівка", 24 },
                    { 1170, "Годилів", 24 },
                    { 1171, "Великий Кучурів", 24 },
                    { 1172, "Тисовець", 24 },
                    { 1173, "Коровія", 24 },
                    { 1174, "Волока", 24 },
                    { 1175, "Чагор", 24 },
                    { 1176, "Магала", 24 },
                    { 1177, "Бояни", 24 },
                    { 1178, "Топорівці", 24 },
                    { 1179, "Колінківці", 24 },
                    { 1180, "Рокитне", 24 },
                    { 1181, "Рідківці", 24 },
                    { 1182, "Мамаївці", 24 },
                    { 1183, "Шипинці", 24 },
                    { 1184, "Дубівці", 24 },
                    { 1185, "Клішківці", 24 },
                    { 1186, "Недобоївці", 24 },
                    { 1187, "Рукшин", 24 },
                    { 1188, "Банилів", 24 },
                    { 1189, "Іспас", 24 },
                    { 1190, "Мигове", 24 },
                    { 1191, "Чорногузи", 24 },
                    { 1192, "Селятин", 24 },
                    { 1193, "Дихтинець", 24 },
                    { 1194, "Ростоки", 24 },
                    { 1195, "Чудей", 24 },
                    { 1196, "Банилів-Підгірний", 24 },
                    { 1197, "Череш", 24 },
                    { 1198, "Кам'янка", 24 },
                    { 1199, "Сучевени", 24 },
                    { 1200, "Тереблече", 24 },
                    { 1201, "Чернігів", 25 },
                    { 1202, "Ніжин", 25 },
                    { 1203, "Прилуки", 25 },
                    { 1204, "Бахмач", 25 },
                    { 1205, "Носівка", 25 },
                    { 1206, "Новгород-Сіверський", 25 },
                    { 1207, "Корюківка", 25 },
                    { 1208, "Городня", 25 },
                    { 1209, "Мена", 25 },
                    { 1210, "Сновськ", 25 },
                    { 1211, "Ічня", 25 },
                    { 1212, "Бобровиця", 25 },
                    { 1213, "Борзна", 25 },
                    { 1214, "Семенівка (Черн.)", 25 },
                    { 1215, "Остер", 25 },
                    { 1216, "Козелець", 25 },
                    { 1217, "Ріпки", 25 },
                    { 1218, "Варва", 25 },
                    { 1219, "Сосниця", 25 },
                    { 1220, "Десна", 25 },
                    { 1221, "Короп", 25 },
                    { 1222, "Талалаївка", 25 },
                    { 1223, "Срібне", 25 },
                    { 1224, "Куликівка", 25 },
                    { 1225, "Михайло-Коцюбинське", 25 },
                    { 1226, "Седнів", 25 },
                    { 1227, "Киїнка", 25 },
                    { 1228, "Новий Білоус", 25 },
                    { 1229, "Старий Білоус", 25 },
                    { 1230, "Рівнопілля", 25 },
                    { 1231, "Халявин", 25 },
                    { 1232, "Полуботки", 25 },
                    { 1233, "Шестовиця", 25 },
                    { 1234, "Іванівка", 25 },
                    { 1235, "Сновянка", 25 },
                    { 1236, "Киселівка", 25 },
                    { 1237, "Березна", 25 },
                    { 1238, "Макошине", 25 },
                    { 1239, "Дягова", 25 },
                    { 1240, "Линовиця", 25 },
                    { 1241, "Дігтярі", 25 },
                    { 1242, "Парафіївка", 25 },
                    { 1243, "Крути", 25 },
                    { 1244, "Плиски", 25 },
                    { 1245, "Лосинівка", 25 },
                    { 1246, "Вертіївка", 25 },
                    { 1247, "Липів Ріг", 25 },
                    { 1248, "Понорниця", 25 },
                    { 1249, "Холми", 25 },
                    { 1250, "Замглай", 25 },
                    { 1251, "Київ", 26 },
                    { 1252, "Севастополь", 27 }
                });

            migrationBuilder.InsertData(
                table: "skills",
                columns: new[] { "Id", "IsHardSkill", "Name", "SkillTypeId" },
                values: new object[,]
                {
                    { 1, false, "Комунікабельність", 1 },
                    { 2, false, "Вміння працювати в команді", 1 },
                    { 3, false, "Емпатія", 1 },
                    { 4, false, "Стресостійкість", 1 },
                    { 5, false, "Критичне мислення", 1 },
                    { 6, false, "Аналітичне мислення", 1 },
                    { 7, false, "Креативність", 1 },
                    { 8, false, "Лідерство", 1 },
                    { 9, false, "Тайм-менеджмент", 1 },
                    { 10, false, "Організованість", 1 },
                    { 11, false, "Вирішення конфліктів", 1 },
                    { 12, false, "Увага до деталей", 1 },
                    { 13, false, "Адаптивність", 1 },
                    { 14, false, "Швидке навчання", 1 },
                    { 15, false, "Орієнтація на результат", 1 },
                    { 16, false, "Ініціативність", 1 },
                    { 17, false, "Самостійність", 1 },
                    { 18, false, "Відповідальність", 1 },
                    { 19, false, "Пунктуальність", 1 },
                    { 20, false, "Гнучкість мислення", 1 },
                    { 21, false, "Публічні виступи", 1 },
                    { 22, false, "Навички ведення переговорів", 1 },
                    { 23, false, "Клієнтоорієнтованість", 1 },
                    { 24, false, "Наставництво (Менторство)", 1 },
                    { 25, false, "Делегування завдань", 1 },
                    { 26, false, "Системне мислення", 1 },
                    { 27, false, "Багатозадачність", 1 },
                    { 28, false, "Емоційний інтелект", 1 },
                    { 29, false, "Вміння працювати з фідбеком", 1 },
                    { 30, false, "Стратегічне мислення", 1 },
                    { 31, false, "Проактивність", 1 },
                    { 32, false, "Наполегливість", 1 },
                    { 33, false, "Толерантність", 1 },
                    { 34, false, "Дипломатичність", 1 },
                    { 35, false, "Самомотивація", 1 },
                    { 36, false, "Самодисципліна", 1 },
                    { 37, false, "Вміння приймати рішення", 1 },
                    { 38, false, "Управління змінами", 1 },
                    { 39, false, "Креативне вирішення проблем", 1 },
                    { 40, false, "Фасилітація", 1 },
                    { 41, false, "Нетворкінг", 1 },
                    { 42, false, "Професійна етика", 1 },
                    { 43, false, "Оптимізм", 1 },
                    { 44, false, "Робота в умовах невизначеності", 1 },
                    { 45, false, "Орієнтація на якість", 1 },
                    { 46, false, "Здатність до самоаналізу", 1 },
                    { 47, false, "Колаборація", 1 },
                    { 48, false, "Презентаційні навички", 1 },
                    { 49, false, "Тактовність", 1 },
                    { 50, false, "Вміння слухати", 1 },
                    { 51, true, "C#", 2 },
                    { 52, true, "Java", 2 },
                    { 53, true, "Python", 2 },
                    { 54, true, "JavaScript", 2 },
                    { 55, true, "TypeScript", 2 },
                    { 56, true, "C++", 2 },
                    { 57, true, "C", 2 },
                    { 58, true, "Ruby", 2 },
                    { 59, true, "PHP", 2 },
                    { 60, true, "Swift", 2 },
                    { 61, true, "Kotlin", 2 },
                    { 62, true, "Go", 2 },
                    { 63, true, "Rust", 2 },
                    { 64, true, "SQL", 2 },
                    { 65, true, "T-SQL", 2 },
                    { 66, true, "PL/SQL", 2 },
                    { 67, true, "HTML5", 2 },
                    { 68, true, "CSS3", 2 },
                    { 69, true, "SASS/SCSS", 2 },
                    { 70, true, "React", 2 },
                    { 71, true, "Angular", 2 },
                    { 72, true, "Vue.js", 2 },
                    { 73, true, "Node.js", 2 },
                    { 74, true, "ASP.NET Core", 2 },
                    { 75, true, "Entity Framework Core", 2 },
                    { 76, true, "Spring Boot", 2 },
                    { 77, true, "Django", 2 },
                    { 78, true, "Flask", 2 },
                    { 79, true, "Express.js", 2 },
                    { 80, true, "Docker", 2 },
                    { 81, true, "Kubernetes", 2 },
                    { 82, true, "AWS", 2 },
                    { 83, true, "Microsoft Azure", 2 },
                    { 84, true, "Google Cloud Platform (GCP)", 2 },
                    { 85, true, "Git", 2 },
                    { 86, true, "CI/CD", 2 },
                    { 87, true, "Jenkins", 2 },
                    { 88, true, "GitHub Actions", 2 },
                    { 89, true, "Linux Administration", 2 },
                    { 90, true, "Bash Scripting", 2 },
                    { 91, true, "PowerShell", 2 },
                    { 92, true, "MongoDB", 2 },
                    { 93, true, "PostgreSQL", 2 },
                    { 94, true, "MySQL", 2 },
                    { 95, true, "Oracle Database", 2 },
                    { 96, true, "Redis", 2 },
                    { 97, true, "RabbitMQ", 2 },
                    { 98, true, "Apache Kafka", 2 },
                    { 99, true, "GraphQL", 2 },
                    { 100, true, "REST API", 2 },
                    { 101, true, "SOAP", 2 },
                    { 102, true, "gRPC", 2 },
                    { 103, true, "Terraform", 2 },
                    { 104, true, "Ansible", 2 },
                    { 105, true, "Unity", 2 },
                    { 106, true, "Unreal Engine", 2 },
                    { 107, true, "Android SDK", 2 },
                    { 108, true, "iOS SDK", 2 },
                    { 109, true, "Flutter", 2 },
                    { 110, true, "React Native", 2 },
                    { 111, true, "Xamarin", 2 },
                    { 112, true, "WPF", 2 },
                    { 113, true, "WinForms", 2 },
                    { 114, true, "Blazor", 2 },
                    { 115, true, "Selenium", 2 },
                    { 116, true, "Cypress", 2 },
                    { 117, true, "NUnit", 2 },
                    { 118, true, "xUnit", 2 },
                    { 119, true, "Jest", 2 },
                    { 120, true, "Scrum", 2 },
                    { 121, true, "Kanban", 2 },
                    { 122, true, "Алгоритми та структури даних", 2 },
                    { 123, true, "Паттерни проектування (Design Patterns)", 2 },
                    { 124, true, "Мікросервісна архітектура", 2 },
                    { 125, true, "Криптографія", 2 },
                    { 126, true, "Вища математика", 3 },
                    { 127, true, "Математичний аналіз", 3 },
                    { 128, true, "Лінійна алгебра", 3 },
                    { 129, true, "Теорія ймовірностей", 3 },
                    { 130, true, "Математична статистика", 3 },
                    { 131, true, "Дискретна математика", 3 },
                    { 132, true, "Диференціальні рівняння", 3 },
                    { 133, true, "Дослідження операцій", 3 },
                    { 134, true, "Математичне моделювання", 3 },
                    { 135, true, "Комбінаторика", 3 },
                    { 136, true, "Статистичний аналіз", 3 },
                    { 137, true, "Machine Learning", 3 },
                    { 138, true, "Deep Learning", 3 },
                    { 139, true, "Data Analysis", 3 },
                    { 140, true, "Data Mining", 3 },
                    { 141, true, "Pandas", 3 },
                    { 142, true, "NumPy", 3 },
                    { 143, true, "Scikit-learn", 3 },
                    { 144, true, "TensorFlow", 3 },
                    { 145, true, "PyTorch", 3 },
                    { 146, true, "Фінансове моделювання", 3 },
                    { 147, true, "Бухгалтерський облік", 3 },
                    { 148, true, "Аудит", 3 },
                    { 149, true, "Економетрика", 3 },
                    { 150, true, "Оцінка ризиків", 3 },
                    { 151, true, "Актуарні розрахунки", 3 },
                    { 152, true, "Обробка природної мови (NLP)", 3 },
                    { 153, true, "Комп'ютерний зір (Computer Vision)", 3 },
                    { 154, true, "Кількісний аналіз", 3 },
                    { 155, true, "Big Data", 3 },
                    { 156, true, "Водійське посвідчення категорії A", 4 },
                    { 157, true, "Водійське посвідчення категорії B", 4 },
                    { 158, true, "Водійське посвідчення категорії C", 4 },
                    { 159, true, "Водійське посвідчення категорії D", 4 },
                    { 160, true, "Водійське посвідчення категорії CE", 4 },
                    { 161, true, "Водіння навантажувача (кара)", 4 },
                    { 162, true, "Водіння трактора", 4 },
                    { 163, true, "Водіння спецтехніки", 4 },
                    { 164, true, "Міжнародні перевезення", 4 },
                    { 165, true, "Транспортна логістика", 4 },
                    { 166, true, "Знання ПДР України та Європи", 4 },
                    { 167, true, "Екстремальне водіння", 4 },
                    { 168, true, "Базова автомеханіка", 4 },
                    { 169, true, "Експедирування вантажів", 4 },
                    { 170, true, "Управління автопарком (Fleet management)", 4 },
                    { 171, true, "Англійська мова (A1 - Beginner)", 5 },
                    { 172, true, "Англійська мова (A2 - Elementary)", 5 },
                    { 173, true, "Англійська мова (B1 - Intermediate)", 5 },
                    { 174, true, "Англійська мова (B2 - Upper-Intermediate)", 5 },
                    { 175, true, "Англійська мова (C1 - Advanced)", 5 },
                    { 176, true, "Англійська мова (C2 - Proficient)", 5 },
                    { 177, true, "Українська мова (вільно)", 5 },
                    { 178, true, "Польська мова", 5 },
                    { 179, true, "Німецька мова", 5 },
                    { 180, true, "Французька мова", 5 },
                    { 181, true, "Іспанська мова", 5 },
                    { 182, true, "Італійська мова", 5 },
                    { 183, true, "Китайська мова (Mandarin)", 5 },
                    { 184, true, "Японська мова", 5 },
                    { 185, true, "Турецька мова", 5 },
                    { 186, true, "Чеська мова", 5 },
                    { 187, true, "Словацька мова", 5 },
                    { 188, true, "Румунська мова", 5 },
                    { 189, true, "Ділова англійська (Business English)", 5 },
                    { 190, true, "Технічна англійська", 5 },
                    { 191, true, "Microsoft Word", 6 },
                    { 192, true, "Microsoft Excel (Advanced)", 6 },
                    { 193, true, "Microsoft PowerPoint", 6 },
                    { 194, true, "Microsoft Outlook", 6 },
                    { 195, true, "1C:Підприємство / BAS", 6 },
                    { 196, true, "Adobe Photoshop", 6 },
                    { 197, true, "Adobe Illustrator", 6 },
                    { 198, true, "Adobe Premiere Pro", 6 },
                    { 199, true, "Adobe After Effects", 6 },
                    { 200, true, "Adobe InDesign", 6 },
                    { 201, true, "CorelDRAW", 6 },
                    { 202, true, "AutoCAD", 6 },
                    { 203, true, "SolidWorks", 6 },
                    { 204, true, "ArchiCAD", 6 },
                    { 205, true, "3ds Max", 6 },
                    { 206, true, "Maya", 6 },
                    { 207, true, "Blender", 6 },
                    { 208, true, "Cinema 4D", 6 },
                    { 209, true, "ZBrush", 6 },
                    { 210, true, "Autodesk Revit", 6 },
                    { 211, true, "SketchUp", 6 },
                    { 212, true, "PRO100", 6 },
                    { 213, true, "SAP ERP", 6 },
                    { 214, true, "Salesforce CRM", 6 },
                    { 215, true, "Bitrix24", 6 },
                    { 216, true, "Jira", 6 },
                    { 217, true, "Confluence", 6 },
                    { 218, true, "Trello", 6 },
                    { 219, true, "Asana", 6 },
                    { 220, true, "Slack", 6 },
                    { 221, true, "Microsoft Teams", 6 },
                    { 222, true, "Zoom", 6 },
                    { 223, true, "OBS Studio", 6 },
                    { 224, true, "DaVinci Resolve", 6 },
                    { 225, true, "Sony Vegas", 6 },
                    { 226, true, "Final Cut Pro", 6 },
                    { 227, true, "FL Studio", 6 },
                    { 228, true, "Ableton Live", 6 },
                    { 229, true, "Logic Pro", 6 },
                    { 230, true, "Adobe Lightroom", 6 },
                    { 231, true, "Figma", 6 },
                    { 232, true, "Canva", 6 },
                    { 233, true, "Power BI", 6 },
                    { 234, true, "Tableau", 6 },
                    { 235, true, "Google Analytics", 6 },
                    { 236, true, "Google Ads", 6 },
                    { 237, true, "Facebook Ads Manager", 6 },
                    { 238, true, "Mailchimp", 6 },
                    { 239, true, "WordPress", 6 },
                    { 240, true, "Shopify", 6 },
                    { 241, true, "Magento", 6 },
                    { 242, true, "Notion", 6 },
                    { 243, true, "Miro", 6 },
                    { 244, true, "Postman", 6 },
                    { 245, true, "Swagger", 6 },
                    { 246, true, "Робота з ЧПУ (CNC)", 7 },
                    { 247, true, "Токарна справа", 7 },
                    { 248, true, "Фрезерна справа", 7 },
                    { 249, true, "Зварювання (TIG/MIG/MAG)", 7 },
                    { 250, true, "Газове зварювання", 7 },
                    { 251, true, "Електродугове зварювання", 7 },
                    { 252, true, "Слюсарна справа", 7 },
                    { 253, true, "Читання технічних креслень", 7 },
                    { 254, true, "Робота з вимірювальним інструментом (штангенциркуль, мікрометр)", 7 },
                    { 255, true, "Металообробка", 7 },
                    { 256, true, "Деревообробка", 7 },
                    { 257, true, "Налаштування верстатів", 7 },
                    { 258, true, "Ремонт промислового обладнання", 7 },
                    { 259, true, "Електромонтаж", 7 },
                    { 260, true, "Пайка плат та мікросхем", 7 },
                    { 261, true, "Робота з осцилографом", 7 },
                    { 262, true, "Програмування ПЛК (PLC)", 7 },
                    { 263, true, "Siemens STEP 7", 7 },
                    { 264, true, "Автоматизація виробництва", 7 },
                    { 265, true, "Техніка безпеки та охорона праці (ОП)", 7 },
                    { 266, true, "Контроль якості (QC)", 7 },
                    { 267, true, "Дефектоскопія", 7 },
                    { 268, true, "Монтаж металоконструкцій", 7 },
                    { 269, true, "Експлуатація котельного обладнання", 7 },
                    { 270, true, "Робота на пресувальному обладнанні", 7 },
                    { 271, true, "B2B продажі", 8 },
                    { 272, true, "B2C продажі", 8 },
                    { 273, true, "Холодні дзвінки", 8 },
                    { 274, true, "Робота із запереченнями", 8 },
                    { 275, true, "Мерчендайзинг", 8 },
                    { 276, true, "Управління запасами", 8 },
                    { 277, true, "Інвентаризація", 8 },
                    { 278, true, "Рекрутинг", 8 },
                    { 279, true, "Сорсинг кандидатів", 8 },
                    { 280, true, "Проведення співбесід", 8 },
                    { 281, true, "Оцінка персоналу", 8 },
                    { 282, true, "Кадрове діловодство", 8 },
                    { 283, true, "Розрахунок заробітної плати", 8 },
                    { 284, true, "Складання договорів", 8 },
                    { 285, true, "Юридичний супровід", 8 },
                    { 286, true, "Зовнішньоекономічна діяльність (ЗЕД)", 8 },
                    { 287, true, "Митне оформлення", 8 },
                    { 288, true, "Організація заходів (Event management)", 8 },
                    { 289, true, "Копірайтинг", 8 },
                    { 290, true, "Рерайтинг", 8 },
                    { 291, true, "Технічне письмо (Technical Writing)", 8 },
                    { 292, true, "PR та зв'язки з громадськістю", 8 },
                    { 293, true, "Бренд-менеджмент", 8 },
                    { 294, true, "Управління проєктами (Project Management)", 8 },
                    { 295, true, "Аналіз ринку", 8 },
                    { 296, true, "Ціноутворення", 8 },
                    { 297, true, "Конкурентний аналіз", 8 },
                    { 298, true, "Управління фінансами", 8 },
                    { 299, true, "Складання бюджету", 8 },
                    { 300, true, "SEO оптимізація", 8 },
                    { 301, true, "Написання сценаріїв (Сценаристика)", 9 },
                    { 302, true, "Редагування та коректура текстів", 9 },
                    { 303, true, "Написання прози", 9 },
                    { 304, true, "Написання поезії", 9 },
                    { 305, true, "Літературна критика", 9 },
                    { 306, true, "Художній переклад", 9 },
                    { 307, true, "Журналістика", 9 },
                    { 308, true, "Проведення інтерв'ю", 9 },
                    { 309, true, "Книжкова ілюстрація", 9 },
                    { 310, true, "Живопис", 9 },
                    { 311, true, "Скульптура", 9 },
                    { 312, true, "Графічний дизайн", 9 },
                    { 313, true, "Каліграфія та летеринг", 9 },
                    { 314, true, "Фотографія (портретна, пейзажна)", 9 },
                    { 315, true, "Репортажна фотографія", 9 },
                    { 316, true, "Акторська майстерність", 9 },
                    { 317, true, "Сценографія", 9 },
                    { 318, true, "Дизайн інтер'єрів", 9 },
                    { 319, true, "Ландшафтний дизайн", 9 },
                    { 320, true, "Кераміка та гончарство", 9 },
                    { 321, true, "Художній розпис", 9 },
                    { 322, true, "Створення коміксів", 9 },
                    { 323, true, "Кураторство виставок", 9 },
                    { 324, true, "Історія мистецтв (експертиза)", 9 },
                    { 325, true, "2D/3D Анімація", 9 },
                    { 326, true, "Композиція музики", 10 },
                    { 327, true, "Музичне аранжування", 10 },
                    { 328, true, "Зведення аудіо (Mixing)", 10 },
                    { 329, true, "Мастеринг аудіо", 10 },
                    { 330, true, "Саунд-дизайн", 10 },
                    { 331, true, "Написання пісень (Songwriting)", 10 },
                    { 332, true, "Гра на гітарі", 10 },
                    { 333, true, "Гра на фортепіано / клавішних", 10 },
                    { 334, true, "Гра на ударних інструментах", 10 },
                    { 335, true, "Вокал (спів)", 10 },
                    { 336, true, "Диригування", 10 },
                    { 337, true, "Знання музичної теорії", 10 },
                    { 338, true, "Режисура кіно та телебачення", 10 },
                    { 339, true, "Операторська майстерність", 10 },
                    { 340, true, "Монтаж відео (Video Editing)", 10 },
                    { 341, true, "Створення візуальних ефектів (VFX)", 10 },
                    { 342, true, "Корекція кольору (Color Grading)", 10 },
                    { 343, true, "Постановка світла (Gaffer)", 10 },
                    { 344, true, "Звукорежисура на майданчику", 10 },
                    { 345, true, "Продюсування музики", 10 },
                    { 346, true, "Продюсування кіно/відео", 10 },
                    { 347, true, "Радіомовлення / Подкастинг", 10 },
                    { 348, true, "Озвучування (Voice-over)", 10 },
                    { 349, true, "Дубляж", 10 },
                    { 350, true, "DJ-інг", 10 },
                    { 351, true, "Агрономія", 11 },
                    { 352, true, "Тваринництво", 11 },
                    { 353, true, "Птахівництво", 11 },
                    { 354, true, "Бджільництво", 11 },
                    { 355, true, "Садівництво", 11 },
                    { 356, true, "Виноградарство", 11 },
                    { 357, true, "Органічне землеробство", 11 },
                    { 358, true, "Догляд за сільськогосподарськими рослинами", 11 },
                    { 359, true, "Заготівля кормів", 11 },
                    { 360, true, "Ветеринарія", 11 },
                    { 361, true, "Управління сільськогосподарською технікою", 11 },
                    { 362, true, "Ремонт та обслуговування агротехніки", 11 },
                    { 363, true, "Селекція та насінництво", 11 },
                    { 364, true, "Гідропоніка", 11 },
                    { 365, true, "Вирощування грибів", 11 },
                    { 366, true, "Тепличне господарство", 11 },
                    { 367, true, "Переробка молока", 11 },
                    { 368, true, "Виробництво сиру (Сироваріння)", 11 },
                    { 369, true, "Агрохімічний аналіз ґрунту", 11 },
                    { 370, true, "Застосування добрив та ЗЗР", 11 },
                    { 371, true, "Управління фермерським господарством", 11 },
                    { 372, true, "Лісове господарство", 11 },
                    { 373, true, "Рибне господарство (Аквакультура)", 11 },
                    { 374, true, "Доїння корів (машинне та ручне)", 11 },
                    { 375, true, "Збір врожаю", 11 },
                    { 376, true, "Обслуговування клієнтів (Customer Service)", 12 },
                    { 377, true, "Робота офіціантом", 12 },
                    { 378, true, "Барменська справа", 12 },
                    { 379, true, "Бариста (Приготування кави)", 12 },
                    { 380, true, "Приготування страв (Кулінарія)", 12 },
                    { 381, true, "Кондитерська справа", 12 },
                    { 382, true, "Пекарська справа", 12 },
                    { 383, true, "Складання та оновлення меню", 12 },
                    { 384, true, "Управління рестораном", 12 },
                    { 385, true, "Готельне адміністрування", 12 },
                    { 386, true, "Бронювання квитків та готелів", 12 },
                    { 387, true, "Екскурсоведення (Гід)", 12 },
                    { 388, true, "Організація туристичних турів", 12 },
                    { 389, true, "Перукарська справа", 12 },
                    { 390, true, "Колористика волосся", 12 },
                    { 391, true, "Макіяж (Візаж)", 12 },
                    { 392, true, "Манікюр та педикюр", 12 },
                    { 393, true, "Косметологія", 12 },
                    { 394, true, "Професійний масаж", 12 },
                    { 395, true, "Касова дисципліна (Робота з РРО)", 12 },
                    { 396, true, "Клінінг (Професійне прибирання)", 12 },
                    { 397, true, "Флористика (Складання букетів)", 12 },
                    { 398, true, "Сомельє (Знання вин)", 12 },
                    { 399, true, "Організація роботи рецепції (Reception)", 12 },
                    { 400, true, "Робота з VIP-клієнтами", 12 }
                });

            migrationBuilder.InsertData(
                table: "specialties",
                columns: new[] { "Id", "IndustryId", "Name" },
                values: new object[,]
                {
                    { 1, 1, "Software Engineer (Програміст)" },
                    { 2, 1, "QA Engineer (Тестувальник)" },
                    { 3, 1, "Project Manager" },
                    { 4, 1, "Product Manager" },
                    { 5, 1, "Business Analyst (Бізнес-аналітик)" },
                    { 6, 1, "Data Scientist / Data Analyst" },
                    { 7, 1, "DevOps Engineer" },
                    { 8, 1, "Системний адміністратор" },
                    { 9, 1, "UX/UI Дизайнер" },
                    { 10, 2, "SEO-спеціаліст" },
                    { 11, 2, "SMM-менеджер" },
                    { 12, 2, "Таргетолог / PPC-спеціаліст" },
                    { 13, 2, "Маркетолог" },
                    { 14, 2, "PR-менеджер" },
                    { 15, 2, "Бренд-менеджер" },
                    { 16, 2, "Копірайтер" },
                    { 17, 2, "Event-менеджер" },
                    { 18, 3, "Менеджер з продажу (Sales Manager)" },
                    { 19, 3, "Торговий представник" },
                    { 20, 3, "Керівник відділу продажу" },
                    { 21, 3, "Менеджер по роботі з клієнтами (Account Manager)" },
                    { 22, 3, "Менеджер із закупівель" },
                    { 23, 3, "Брокер" },
                    { 24, 4, "Головний бухгалтер" },
                    { 25, 4, "Бухгалтер" },
                    { 26, 4, "Фінансовий аналітик" },
                    { 27, 4, "Аудитор" },
                    { 28, 4, "Економіст" },
                    { 29, 4, "Податковий консультант" },
                    { 30, 4, "Касир" },
                    { 31, 5, "Логіст" },
                    { 32, 5, "Водій-експедитор" },
                    { 33, 5, "Комірник" },
                    { 34, 5, "Вантажник" },
                    { 35, 5, "Менеджер ЗЕД" },
                    { 36, 5, "Митний брокер" },
                    { 37, 5, "Керівник складу" },
                    { 38, 6, "Агроном" },
                    { 39, 6, "Ветеринар" },
                    { 40, 6, "Тракторист / Комбайнер" },
                    { 41, 6, "Зоотехнік" },
                    { 42, 6, "Технолог харчової промисловості" },
                    { 43, 6, "Фермер / Керуючий господарством" },
                    { 44, 7, "Інженер-конструктор" },
                    { 45, 7, "Інженер-механік" },
                    { 46, 7, "Оператор ЧПУ (CNC)" },
                    { 47, 7, "Зварювальник" },
                    { 48, 7, "Слюсар" },
                    { 49, 7, "Електрик / Електромонтер" },
                    { 50, 7, "Майстер цеху / Начальник виробництва" },
                    { 51, 7, "Технолог" },
                    { 52, 8, "Лікар (Загальна практика)" },
                    { 53, 8, "Медсестра / Медбрат" },
                    { 54, 8, "Фармацевт / Провізор" },
                    { 55, 8, "Стоматолог" },
                    { 56, 8, "Медичний представник" },
                    { 57, 8, "Лаборант" },
                    { 58, 8, "Хірург" },
                    { 59, 9, "Кухар / Шеф-кухар" },
                    { 60, 9, "Офіціант" },
                    { 61, 9, "Бармен" },
                    { 62, 9, "Бариста" },
                    { 63, 9, "Менеджер ресторану / Адміністратор" },
                    { 64, 9, "Адміністратор готелю (Ресепшіоніст)" },
                    { 65, 9, "Туристичний агент / Гід" },
                    { 66, 9, "Покоївка" },
                    { 67, 10, "Графічний дизайнер" },
                    { 68, 10, "Відеомонтажер (Video Editor)" },
                    { 69, 10, "Фотограф / Відеооператор" },
                    { 70, 10, "Журналіст / Репортер" },
                    { 71, 10, "Редактор" },
                    { 72, 10, "Актор" },
                    { 73, 10, "Звукорежисер" },
                    { 74, 10, "Ілюстратор / Художник" },
                    { 75, 11, "Архітектор" },
                    { 76, 11, "Виконроб (Керівник будівельних робіт)" },
                    { 77, 11, "Будівельник / Різноробочий" },
                    { 78, 11, "Маляр-штукатур" },
                    { 79, 11, "Сантехнік" },
                    { 80, 11, "Монтажник" },
                    { 81, 11, "Інженер-проектувальник" },
                    { 82, 12, "Вчитель / Викладач" },
                    { 83, 12, "Репетитор" },
                    { 84, 12, "Перекладач" },
                    { 85, 12, "Науковий співробітник" },
                    { 86, 12, "Методист" },
                    { 87, 12, "Вихователь" },
                    { 88, 13, "Юрист / Юрисконсульт" },
                    { 89, 13, "Адвокат" },
                    { 90, 13, "Нотаріус" },
                    { 91, 13, "Помічник юриста" },
                    { 92, 13, "Слідчий / Детектив" },
                    { 93, 14, "HR-менеджер" },
                    { 94, 14, "Рекрутер" },
                    { 95, 14, "Сорсер (Talent Sourcer)" },
                    { 96, 14, "Спеціаліст з навчання (L&D)" },
                    { 97, 14, "Кадровик (Фахівець з діловодства)" },
                    { 98, 15, "Продавець-консультант" },
                    { 99, 15, "Керуючий магазином" },
                    { 100, 15, "Мерчендайзер" },
                    { 101, 15, "Касир торговельного залу" },
                    { 102, 15, "Адміністратор торгового залу" },
                    { 103, 15, "Фахівець з приймання товару" }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "application_statuses",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "application_statuses",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "application_statuses",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "currencies",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "currencies",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "currencies",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 231);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 232);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 233);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 234);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 235);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 236);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 237);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 238);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 239);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 240);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 241);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 242);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 243);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 244);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 245);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 246);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 247);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 248);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 249);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 250);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 251);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 252);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 253);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 254);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 255);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 256);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 257);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 258);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 259);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 260);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 261);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 262);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 263);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 264);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 265);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 266);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 267);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 268);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 269);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 270);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 271);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 272);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 273);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 274);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 275);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 276);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 277);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 278);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 279);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 280);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 281);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 282);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 283);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 284);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 285);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 286);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 287);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 288);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 289);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 290);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 291);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 292);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 293);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 294);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 295);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 296);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 297);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 298);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 299);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 300);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 301);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 302);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 303);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 304);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 305);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 306);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 307);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 308);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 309);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 310);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 311);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 312);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 313);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 314);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 315);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 316);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 317);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 318);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 319);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 320);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 321);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 322);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 323);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 324);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 325);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 326);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 327);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 328);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 329);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 330);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 331);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 332);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 333);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 334);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 335);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 336);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 337);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 338);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 339);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 340);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 341);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 342);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 343);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 344);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 345);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 346);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 347);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 348);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 349);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 350);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 351);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 352);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 353);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 354);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 355);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 356);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 357);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 358);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 359);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 360);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 361);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 362);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 363);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 364);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 365);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 366);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 367);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 368);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 369);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 370);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 371);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 372);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 373);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 374);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 375);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 376);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 377);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 378);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 379);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 380);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 381);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 382);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 383);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 384);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 385);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 386);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 387);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 388);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 389);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 390);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 391);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 392);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 393);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 394);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 395);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 396);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 397);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 398);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 399);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 400);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 401);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 402);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 403);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 404);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 405);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 406);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 407);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 408);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 409);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 410);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 411);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 412);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 413);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 414);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 415);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 416);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 417);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 418);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 419);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 420);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 421);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 422);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 423);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 424);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 425);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 426);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 427);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 428);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 429);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 430);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 431);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 432);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 433);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 434);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 435);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 436);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 437);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 438);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 439);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 440);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 441);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 442);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 443);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 444);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 445);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 446);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 447);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 448);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 449);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 450);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 451);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 452);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 453);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 454);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 455);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 456);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 457);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 458);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 459);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 460);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 461);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 462);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 463);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 464);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 465);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 466);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 467);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 468);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 469);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 470);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 471);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 472);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 473);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 474);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 475);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 476);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 477);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 478);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 479);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 480);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 481);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 482);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 483);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 484);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 485);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 486);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 487);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 488);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 489);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 490);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 491);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 492);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 493);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 494);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 495);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 496);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 497);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 498);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 499);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 500);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 501);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 502);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 503);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 504);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 505);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 506);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 507);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 508);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 509);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 510);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 511);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 512);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 513);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 514);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 515);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 516);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 517);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 518);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 519);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 520);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 521);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 522);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 523);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 524);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 525);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 526);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 527);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 528);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 529);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 530);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 531);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 532);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 533);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 534);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 535);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 536);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 537);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 538);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 539);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 540);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 541);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 542);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 543);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 544);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 545);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 546);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 547);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 548);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 549);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 550);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 551);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 552);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 553);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 554);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 555);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 556);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 557);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 558);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 559);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 560);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 561);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 562);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 563);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 564);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 565);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 566);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 567);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 568);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 569);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 570);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 571);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 572);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 573);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 574);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 575);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 576);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 577);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 578);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 579);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 580);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 581);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 582);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 583);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 584);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 585);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 586);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 587);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 588);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 589);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 590);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 591);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 592);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 593);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 594);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 595);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 596);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 597);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 598);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 599);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 600);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 601);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 602);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 603);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 604);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 605);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 606);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 607);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 608);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 609);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 610);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 611);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 612);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 613);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 614);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 615);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 616);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 617);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 618);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 619);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 620);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 621);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 622);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 623);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 624);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 625);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 626);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 627);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 628);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 629);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 630);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 631);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 632);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 633);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 634);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 635);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 636);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 637);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 638);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 639);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 640);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 641);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 642);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 643);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 644);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 645);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 646);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 647);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 648);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 649);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 650);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 651);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 652);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 653);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 654);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 655);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 656);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 657);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 658);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 659);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 660);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 661);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 662);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 663);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 664);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 665);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 666);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 667);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 668);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 669);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 670);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 671);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 672);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 673);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 674);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 675);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 676);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 677);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 678);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 679);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 680);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 681);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 682);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 683);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 684);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 685);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 686);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 687);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 688);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 689);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 690);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 691);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 692);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 693);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 694);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 695);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 696);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 697);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 698);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 699);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 700);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 701);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 702);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 703);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 704);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 705);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 706);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 707);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 708);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 709);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 710);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 711);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 712);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 713);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 714);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 715);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 716);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 717);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 718);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 719);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 720);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 721);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 722);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 723);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 724);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 725);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 726);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 727);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 728);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 729);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 730);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 731);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 732);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 733);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 734);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 735);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 736);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 737);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 738);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 739);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 740);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 741);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 742);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 743);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 744);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 745);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 746);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 747);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 748);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 749);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 750);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 751);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 752);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 753);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 754);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 755);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 756);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 757);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 758);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 759);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 760);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 761);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 762);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 763);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 764);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 765);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 766);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 767);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 768);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 769);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 770);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 771);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 772);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 773);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 774);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 775);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 776);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 777);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 778);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 779);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 780);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 781);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 782);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 783);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 784);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 785);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 786);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 787);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 788);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 789);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 790);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 791);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 792);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 793);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 794);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 795);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 796);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 797);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 798);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 799);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 800);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 801);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 802);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 803);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 804);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 805);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 806);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 807);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 808);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 809);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 810);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 811);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 812);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 813);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 814);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 815);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 816);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 817);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 818);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 819);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 820);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 821);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 822);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 823);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 824);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 825);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 826);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 827);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 828);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 829);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 830);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 831);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 832);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 833);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 834);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 835);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 836);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 837);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 838);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 839);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 840);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 841);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 842);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 843);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 844);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 845);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 846);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 847);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 848);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 849);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 850);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 851);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 852);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 853);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 854);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 855);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 856);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 857);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 858);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 859);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 860);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 861);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 862);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 863);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 864);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 865);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 866);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 867);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 868);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 869);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 870);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 871);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 872);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 873);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 874);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 875);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 876);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 877);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 878);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 879);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 880);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 881);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 882);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 883);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 884);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 885);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 886);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 887);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 888);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 889);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 890);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 891);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 892);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 893);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 894);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 895);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 896);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 897);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 898);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 899);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 900);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 901);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 902);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 903);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 904);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 905);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 906);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 907);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 908);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 909);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 910);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 911);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 912);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 913);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 914);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 915);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 916);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 917);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 918);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 919);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 920);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 921);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 922);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 923);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 924);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 925);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 926);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 927);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 928);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 929);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 930);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 931);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 932);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 933);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 934);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 935);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 936);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 937);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 938);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 939);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 940);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 941);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 942);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 943);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 944);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 945);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 946);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 947);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 948);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 949);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 950);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 951);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 952);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 953);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 954);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 955);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 956);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 957);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 958);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 959);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 960);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 961);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 962);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 963);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 964);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 965);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 966);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 967);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 968);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 969);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 970);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 971);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 972);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 973);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 974);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 975);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 976);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 977);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 978);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 979);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 980);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 981);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 982);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 983);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 984);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 985);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 986);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 987);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 988);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 989);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 990);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 991);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 992);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 993);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 994);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 995);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 996);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 997);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 998);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 999);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1000);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1001);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1002);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1003);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1004);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1005);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1006);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1007);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1008);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1009);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1010);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1011);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1012);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1013);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1014);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1015);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1016);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1017);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1018);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1019);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1020);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1021);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1022);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1023);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1024);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1025);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1026);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1027);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1028);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1029);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1030);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1031);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1032);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1033);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1034);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1035);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1036);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1037);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1038);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1039);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1040);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1041);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1042);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1043);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1044);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1045);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1046);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1047);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1048);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1049);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1050);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1051);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1052);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1053);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1054);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1055);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1056);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1057);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1058);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1059);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1060);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1061);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1062);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1063);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1064);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1065);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1066);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1067);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1068);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1069);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1070);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1071);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1072);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1073);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1074);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1075);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1076);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1077);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1078);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1079);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1080);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1081);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1082);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1083);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1084);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1085);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1086);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1087);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1088);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1089);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1090);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1091);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1092);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1093);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1094);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1095);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1096);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1097);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1098);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1099);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1100);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1101);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1102);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1103);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1104);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1105);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1106);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1107);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1108);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1109);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1110);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1111);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1112);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1113);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1114);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1115);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1116);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1117);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1118);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1119);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1120);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1121);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1122);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1123);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1124);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1125);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1126);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1127);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1128);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1129);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1130);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1131);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1132);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1133);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1134);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1135);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1136);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1137);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1138);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1139);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1140);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1141);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1142);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1143);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1144);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1145);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1146);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1147);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1148);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1149);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1150);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1151);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1152);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1153);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1154);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1155);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1156);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1157);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1158);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1159);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1160);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1161);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1162);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1163);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1164);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1165);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1166);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1167);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1168);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1169);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1170);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1171);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1172);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1173);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1174);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1175);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1176);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1177);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1178);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1179);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1180);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1181);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1182);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1183);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1184);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1185);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1186);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1187);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1188);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1189);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1190);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1191);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1192);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1193);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1194);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1195);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1196);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1197);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1198);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1199);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1200);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1201);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1202);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1203);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1204);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1205);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1206);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1207);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1208);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1209);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1210);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1211);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1212);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1213);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1214);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1215);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1216);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1217);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1218);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1219);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1220);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1221);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1222);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1223);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1224);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1225);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1226);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1227);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1228);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1229);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1230);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1231);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1232);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1233);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1234);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1235);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1236);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1237);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1238);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1239);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1240);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1241);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1242);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1243);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1244);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1245);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1246);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1247);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1248);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1249);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1250);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1251);

            migrationBuilder.DeleteData(
                table: "locations",
                keyColumn: "Id",
                keyValue: 1252);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 104);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 105);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 106);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 107);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 108);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 109);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 110);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 111);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 112);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 113);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 114);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 115);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 116);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 117);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 118);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 119);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 120);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 121);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 122);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 123);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 124);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 125);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 126);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 127);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 128);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 129);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 130);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 131);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 132);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 133);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 134);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 135);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 136);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 137);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 138);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 139);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 140);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 141);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 142);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 143);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 144);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 145);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 146);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 147);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 148);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 149);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 150);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 151);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 152);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 153);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 154);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 155);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 156);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 157);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 158);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 159);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 160);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 161);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 162);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 163);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 164);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 165);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 166);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 167);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 168);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 169);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 170);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 171);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 172);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 173);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 174);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 175);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 176);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 177);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 178);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 179);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 180);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 181);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 182);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 183);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 184);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 185);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 186);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 187);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 188);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 189);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 190);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 191);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 192);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 193);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 194);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 195);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 196);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 197);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 198);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 199);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 200);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 201);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 202);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 203);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 204);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 205);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 206);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 207);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 208);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 209);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 210);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 211);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 212);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 213);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 214);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 215);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 216);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 217);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 218);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 219);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 220);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 221);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 222);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 223);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 224);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 225);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 226);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 227);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 228);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 229);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 230);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 231);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 232);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 233);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 234);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 235);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 236);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 237);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 238);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 239);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 240);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 241);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 242);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 243);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 244);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 245);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 246);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 247);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 248);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 249);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 250);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 251);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 252);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 253);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 254);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 255);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 256);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 257);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 258);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 259);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 260);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 261);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 262);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 263);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 264);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 265);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 266);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 267);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 268);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 269);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 270);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 271);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 272);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 273);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 274);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 275);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 276);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 277);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 278);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 279);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 280);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 281);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 282);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 283);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 284);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 285);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 286);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 287);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 288);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 289);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 290);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 291);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 292);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 293);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 294);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 295);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 296);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 297);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 298);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 299);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 300);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 301);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 302);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 303);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 304);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 305);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 306);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 307);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 308);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 309);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 310);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 311);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 312);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 313);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 314);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 315);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 316);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 317);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 318);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 319);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 320);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 321);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 322);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 323);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 324);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 325);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 326);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 327);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 328);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 329);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 330);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 331);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 332);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 333);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 334);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 335);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 336);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 337);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 338);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 339);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 340);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 341);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 342);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 343);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 344);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 345);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 346);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 347);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 348);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 349);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 350);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 351);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 352);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 353);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 354);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 355);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 356);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 357);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 358);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 359);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 360);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 361);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 362);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 363);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 364);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 365);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 366);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 367);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 368);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 369);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 370);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 371);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 372);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 373);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 374);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 375);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 376);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 377);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 378);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 379);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 380);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 381);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 382);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 383);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 384);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 385);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 386);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 387);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 388);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 389);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 390);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 391);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 392);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 393);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 394);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 395);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 396);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 397);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 398);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 399);

            migrationBuilder.DeleteData(
                table: "skills",
                keyColumn: "Id",
                keyValue: 400);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 28);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 29);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 30);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 31);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 32);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 33);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 34);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 35);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 36);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 37);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 38);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 39);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 40);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 41);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 42);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 43);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 44);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 45);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 46);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 47);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 48);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 49);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 50);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 51);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 52);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 53);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 54);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 55);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 56);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 57);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 58);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 59);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 60);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 61);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 62);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 63);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 64);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 65);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 66);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 67);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 68);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 69);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 70);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 71);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 72);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 73);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 74);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 75);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 76);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 77);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 78);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 79);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 80);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 81);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 82);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 83);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 84);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 85);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 86);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 87);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 88);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 89);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 90);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 91);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 92);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 93);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 94);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 95);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 96);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 97);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 98);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 99);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 100);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 101);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 102);

            migrationBuilder.DeleteData(
                table: "specialties",
                keyColumn: "Id",
                keyValue: 103);

            migrationBuilder.DeleteData(
                table: "user_roles",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "user_roles",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "user_roles",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "industries",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 13);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 14);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 15);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 16);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 17);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 18);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 19);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 20);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 21);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 22);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 23);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 24);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 25);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 26);

            migrationBuilder.DeleteData(
                table: "regions",
                keyColumn: "Id",
                keyValue: 27);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 1);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 2);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 3);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 4);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 5);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 6);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 7);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 8);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 9);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 10);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 11);

            migrationBuilder.DeleteData(
                table: "skill_types",
                keyColumn: "Id",
                keyValue: 12);

            migrationBuilder.CreateTable(
                name: "resumes_documents",
                columns: table => new
                {
                    Id = table.Column<int>(type: "int", nullable: false),
                    FileExtension = table.Column<string>(type: "nvarchar(20)", maxLength: 20, nullable: false),
                    FileLength = table.Column<int>(type: "int", nullable: false),
                    FileName = table.Column<string>(type: "nvarchar(255)", maxLength: 255, nullable: false),
                    FilePath = table.Column<string>(type: "nvarchar(512)", maxLength: 512, nullable: false),
                    UploadedAt = table.Column<DateTime>(type: "datetime2", nullable: false)
                },
                constraints: table =>
                {
                    table.PrimaryKey("PK_resumes_documents", x => x.Id);
                    table.ForeignKey(
                        name: "FK_resumes_documents_resumes_Id",
                        column: x => x.Id,
                        principalTable: "resumes",
                        principalColumn: "Id",
                        onDelete: ReferentialAction.Restrict);
                });
        }
    }
}
